"Only humans can think in three levels of recursion, and all other magical races stop at 2." What are the implications of this.8szydz.org
#+TITLE: "Only humans can think in three levels of recursion, and all other magical races stop at 2." What are the implications of this?

* "Only humans can think in three levels of recursion, and all other magical races stop at 2." What are the implications of this?
:PROPERTIES:
:Author: Lightwavers
:Score: 39
:DateUnix: 1529659252.0
:END:
#+begin_quote
  Only humans can think in three levels of recursion, and all other magical races stop at 2.
#+end_quote

---Eliezer Yudkowsky

Okay, I think I get what this /is/. You can think about a car, and then think about how you thought about that car, and then think about how you thought about thinking about that car. But what actual implications would this have, aside from the obvious? This just seems really abstract, like something a competent programmer could use is some very specific function, but which is otherwise practically useless for everything except philosophy.


** Forget about thinking about what /you/ think. If you can't think about what /other people/ think you think, then you can't be a very good liar. You can tell lies - try to get other people to think certain things - but you can't think about your lies, and adapt them based on what you think other people think. This will cripple your ability to engage in deception.

But I think you're still one level down from what Mr. Yudkowsky meant. Thinking about cars is level zero, the object level. Thinking about how you thought about the car is recursing once, and thinking about that is recursing twice. So magical races actually can think about their lies, but only humans can go further. This means that while magical races can believably lie, only humans can believably lie about lying. Magical races can use spies and informants, but only humans can use double agents. Only humans can even think about the concept of double agents, without going cross-eyed and needing to work it out on paper.

Also, only humans can realize that someone is trying to make them think that they are lying. Say, Alice saw a red car, but wants Bob to think that the car is blue. Any magical race can say "The car is blue," and fill in details of the story, adjusting to the picture Bob has (2) of the picture Alice is trying to make for him (1) of the car (0). But if Alice is human, then she can avoid eye contact and fidget uncomfortably and mumble, "The car is bl- I mean, /red/." Bob instantly thinks: Alice wants (2) Bob to think (1) that the car is red (0). She is lying badly, and the car is probably actually blue. Bob congratulates himself on piercing the deception. Alice wins, because humans can pretend to pretend.
:PROPERTIES:
:Author: Anakiri
:Score: 93
:DateUnix: 1529663286.0
:END:

*** In coming up with this argument you've engaged in four levels of recursion. Right?

I don't buy it. There's only a couple of pieces of information you have to keep track of to map recursion into iteration here, and you can do that in your short term memory. You don't even need paper.
:PROPERTIES:
:Author: ArgentStonecutter
:Score: 26
:DateUnix: 1529663687.0
:END:

**** I can do it in my short term memory without needing paper because I'm human. An elf would need paper to work through it, once they realized that there was more to the problem in the first place. And the elf /could/ work through it, it just wouldn't be intuitive. As opposed to a human Bob, whose literal first instinct would be "Either the car is blue, or Alice wants me to think the car is blue." If Alice is a known competent liar, then it might not even occur to human-Bob that Alice might be having an off day - the car is definitely not blue.

Humans can't actually get much deeper than that in practice, on an intuitive level. We tend to immediately get stuck in a loop of, "But what if that's what she wanted me to think she thought I thought she thought? Damnit, get me some paper." At some point in recursion/iteration (you're right, there is no computational difference in this context), every higher level of abstraction is indistinguishable to you. It's entirely possible for different people/races to hit that point at different levels. That fact can have interesting worldbuilding implications.

Not every elf will notice that the problem even requires further thought. Not every elf will care to give the problem more thought even if they recognize that the human is being all /human/ about it, and would prefer to just ignore all information from humans. Not every elf will have the Nobel Prize winning insight to be able to work through the bizarre twisty nature of human minds even if they wanted to. Some will. It is very unlikely that this is a hard limit. But the difference can have interesting implications for interactions between random people on the street.
:PROPERTIES:
:Author: Anakiri
:Score: 39
:DateUnix: 1529668309.0
:END:

