posts/"Only humans can think in three levels of recursion, and all other magical races stop at 2." What are the implications of this.8szydz.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-05-31 Mon 05:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>"Only humans can think in three levels of recursion, and all other magical races stop at 2." What are the implications of this?</title>
<meta name="author" content="Fereidoon" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content">
<h1 class="title">&ldquo;Only humans can think in three levels of recursion, and all other magical races stop at 2.&rdquo; What are the implications of this?</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org71689b6">1. &ldquo;Only humans can think in three levels of recursion, and all other magical races stop at 2.&rdquo; What are the implications of this?</a>
<ul>
<li><a href="#orgb1e4bbf">1.1. Forget about thinking about what <i>you</i> think. If you can&rsquo;t think about what <i>other people</i> think you think, then you can&rsquo;t be a very good liar. You can tell lies - try to get other people to think certain things - but you can&rsquo;t think about your lies, and adapt them based on what you think other people think. This will cripple your ability to engage in deception.</a>
<ul>
<li><a href="#org30291a5">1.1.1. In coming up with this argument you&rsquo;ve engaged in four levels of recursion. Right?</a></li>
<li><a href="#orgdda91cd">1.1.2. #+begin<sub>quote</sub></a></li>
<li><a href="#orga0ab738">1.1.3. This makes sense. Thanks for entertaining the scenario.</a></li>
</ul>
</li>
<li><a href="#org8cedb96">1.2. This idea is inspired from a quote &ldquo;in practice, infinite recursions are at most three levels deep.&rdquo;</a>
<ul>
<li><a href="#orgf110782">1.2.1. Aaah, thanks. I like this explanation. So humans would be master liars, and no one else would no what was going on.</a></li>
</ul>
</li>
<li><a href="#org787bc3d">1.3. This is not technically a computational limitation in cognition. Anything you can do with recursion you can do with iteration and some book-keeping. Ink and paper and Bob&rsquo;s your uncle.</a>
<ul>
<li><a href="#org107c926">1.3.1. Alright, but let&rsquo;s instate a fascist government and burn all the books. What does three levels of recursion actually allow you to do that you can&rsquo;t with just two? I cannot think of a single practical thing.</a></li>
<li><a href="#orgdaa362a">1.3.2. You won&rsquo;t get very far in the game of political intrigue if you&rsquo;re breaking out the pen and paper for plots everyone else is doing in their head.</a></li>
</ul>
</li>
<li><a href="#orgf2c9216">1.4. This topic is a black hole of contemplation. It&rsquo;s far too easy to just sit down and try to puzzle it out. It&rsquo;s fun thought, and potentially useful (for psychology especially).</a>
<ul>
<li><a href="#org5287bf6">1.4.1. Haha, I wasn&rsquo;t dissing the idea. I asked because it seemed interesting but I didn&rsquo;t know what exactly it meant. :)</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org71689b6" class="outline-2">
<h2 id="org71689b6"><span class="section-number-2">1</span> &ldquo;Only humans can think in three levels of recursion, and all other magical races stop at 2.&rdquo; What are the implications of this?</h2>
<div class="outline-text-2" id="text-1">
<blockquote>
<p>
Only humans can think in three levels of recursion, and all other magical races stop at 2.
</p>
</blockquote>

<p>
&#x2014;Eliezer Yudkowsky
</p>

<p>
Okay, I think I get what this <i>is</i>. You can think about a car, and then think about how you thought about that car, and then think about how you thought about thinking about that car. But what actual implications would this have, aside from the obvious? This just seems really abstract, like something a competent programmer could use is some very specific function, but which is otherwise practically useless for everything except philosophy.
</p>
</div>


<div id="outline-container-orgb1e4bbf" class="outline-3">
<h3 id="orgb1e4bbf"><span class="section-number-3">1.1</span> Forget about thinking about what <i>you</i> think. If you can&rsquo;t think about what <i>other people</i> think you think, then you can&rsquo;t be a very good liar. You can tell lies - try to get other people to think certain things - but you can&rsquo;t think about your lies, and adapt them based on what you think other people think. This will cripple your ability to engage in deception.</h3>
<div class="outline-text-3" id="text-1-1">
<p>
But I think you&rsquo;re still one level down from what Mr. Yudkowsky meant. Thinking about cars is level zero, the object level. Thinking about how you thought about the car is recursing once, and thinking about that is recursing twice. So magical races actually can think about their lies, but only humans can go further. This means that while magical races can believably lie, only humans can believably lie about lying. Magical races can use spies and informants, but only humans can use double agents. Only humans can even think about the concept of double agents, without going cross-eyed and needing to work it out on paper.
</p>

<p>
Also, only humans can realize that someone is trying to make them think that they are lying. Say, Alice saw a red car, but wants Bob to think that the car is blue. Any magical race can say &ldquo;The car is blue,&rdquo; and fill in details of the story, adjusting to the picture Bob has (2) of the picture Alice is trying to make for him (1) of the car (0). But if Alice is human, then she can avoid eye contact and fidget uncomfortably and mumble, &ldquo;The car is bl- I mean, <i>red</i>.&rdquo; Bob instantly thinks: Alice wants (2) Bob to think (1) that the car is red (0). She is lying badly, and the car is probably actually blue. Bob congratulates himself on piercing the deception. Alice wins, because humans can pretend to pretend.
</p>
<p>
:Author: Anakiri
:Score: 93
:DateUnix: 1529663286.0
</p>
</div>

<div id="outline-container-org30291a5" class="outline-4">
<h4 id="org30291a5"><span class="section-number-4">1.1.1</span> In coming up with this argument you&rsquo;ve engaged in four levels of recursion. Right?</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
I don&rsquo;t buy it. There&rsquo;s only a couple of pieces of information you have to keep track of to map recursion into iteration here, and you can do that in your short term memory. You don&rsquo;t even need paper.
</p>
<p>
:Author: ArgentStonecutter
:Score: 26
:DateUnix: 1529663687.0
</p>
</div>

<ol class="org-ol">
<li><a id="org5d9626a"></a>I can do it in my short term memory without needing paper because I&rsquo;m human. An elf would need paper to work through it, once they realized that there was more to the problem in the first place. And the elf <i>could</i> work through it, it just wouldn&rsquo;t be intuitive. As opposed to a human Bob, whose literal first instinct would be &ldquo;Either the car is blue, or Alice wants me to think the car is blue.&rdquo; If Alice is a known competent liar, then it might not even occur to human-Bob that Alice might be having an off day - the car is definitely not blue.<br />
<div class="outline-text-5" id="text-1-1-1-1">
<p>
Humans can&rsquo;t actually get much deeper than that in practice, on an intuitive level. We tend to immediately get stuck in a loop of, &ldquo;But what if that&rsquo;s what she wanted me to think she thought I thought she thought? Damnit, get me some paper.&rdquo; At some point in recursion/iteration (you&rsquo;re right, there is no computational difference in this context), every higher level of abstraction is indistinguishable to you. It&rsquo;s entirely possible for different people/races to hit that point at different levels. That fact can have interesting worldbuilding implications.
</p>

<p>
Not every elf will notice that the problem even requires further thought. Not every elf will care to give the problem more thought even if they recognize that the human is being all <i>human</i> about it, and would prefer to just ignore all information from humans. Not every elf will have the Nobel Prize winning insight to be able to work through the bizarre twisty nature of human minds even if they wanted to. Some will. It is very unlikely that this is a hard limit. But the difference can have interesting implications for interactions between random people on the street.
</p>
<p>
:Author: Anakiri
:Score: 39
:DateUnix: 1529668309.0
</p>
</div>

<ol class="org-ol">
