"Only humans can think in three levels of recursion, and all other magical races stop at 2." What are the implications of this.8szydz.org
***** It's not that we /can't/ go deeper intuitively, it's that it's impractical to go any deeper than a really good lie unless you can model the other person very well, since it's so easy to backfire. Simplest solution and all that. You're more likely to succeed with a good lie than with trying to convince someone you were trying to lie to them recursively.

We usually figure out lies through body language and context, if you can control those well enough to lie there's no reason to go any deeper.

Say Alice is a good liar, Bob knows this. Alice seems to fumble in the lie, Bob knows she wouldn't do that. So the fumble must be intentional. Alice knows Bob knows she's a good liar, so he knows she wouldn't fumble except on purpose, so it can't be the obvious (that the car really is red and she's trying to convince him it's blue) since she knows he'd see through that. At this point you enter a bunch of recursions where Bob is wondering how well she predicted how he interpreted what she did, and then decides to go one level above it...unless she predicted /that/. Alice can't reasonably predict how Bob will think about this, so you basically just have it down to random chance.

By fumbling the lie intentionally, Alice gave away that she was trying to lie about something. She would have better odds of succeeding by just lying since Bob wouldn't have suspected anything.
:PROPERTIES:
:Author: EthanCC
:Score: 7
:DateUnix: 1529693602.0
:END:


***** If you only need a small amount of bookkeeping (<5-9 items) you can do it without the paper once you jave learned the algorithm.

Algorithms are learnable. You don't need to be Einstein to understand Relativity. They can be written down. They are not subject to the Interdict. This one would be taught at Gringotts in 'Humans 101'.
:PROPERTIES:
:Author: ArgentStonecutter
:Score: 9
:DateUnix: 1529669176.0
:END:

****** Indeed. You could write an interesting story about what mental mechanisms non-humans have to use to adapt to this difference. But you seem to be admitting that non-humans would, in fact, require some learned non-intuitive mechanisms. What would Humans 101 teach goblins that they should watch out for?
:PROPERTIES:
:Author: Anakiri
:Score: 12
:DateUnix: 1529669828.0
:END:

******* Nothing is intuitive but the nipple. It's all learned.
:PROPERTIES:
:Author: ArgentStonecutter
:Score: 4
:DateUnix: 1529669893.0
:END:

******** Okay, but suppose that while different races /can/ learn anything, humans find it much, much easier to learn about thinking about thinking about thinking about things than goblins do. Regardless of whether that's how it works in the real world, suppose you're writing about a world where that is how it works. Most goblins can't get their heads around third level recursion before they're college age. It's your job to set up the curriculum for that class. What do you say, on the first day of class, to convince your goblin students that they should care about third level recursion and higher, instead of dropping it in favor of easier and more interesting classes like Microeconomic Effects of Promissory Notes in Eighth Century Ruritania II?
:PROPERTIES:
:Author: Anakiri
:Score: 13
:DateUnix: 1529671266.0
:END:

********* #+begin_quote
  Regardless of whether that's how it works in the real world, suppose you're writing about a world where that is how it works.
#+end_quote

My point, which I'm trying to close in on, is that the HPMoR world seems to be one where the Strong C-T hypothesis holds, so it's not actually consistent with the way that world works.

If you want to read some rational stories set in a world where the strong C-T hypothesis is REALLY taken seriously, I suggest /Permutation City/, /Diaspora/, and /Schild's Ladder/ by Greg Egan.

Permutation City was about his first book, so the climactic arc is kind of forced and kind of breaks consistency, but the Copy society and Solipsist Nation are fascinating. Diaspora and Schild's Ladder are totally solid (and the latter has some existential fridge horror that's worth the trip).

But assuming the counterfactual, that's easy: "If you don't pass this course you can not work in any human-facing position in Gringotts."
:PROPERTIES:
:Author: ArgentStonecutter
:Score: 0
:DateUnix: 1529671496.0
:END:

********** Ah... You are aware that you are in [[/r/rational]], not [[/r/hpmor]], yes? Even the [[https://www.reddit.com/r/rational/comments/870yhg/bst_ways_to_make_mugglesmortals_interesting/dwa703i/][original statement]] wasn't about HPMoR. It was just a hypothetical way that, in /any/ story, an author could make a meaningful difference between humans and other magical races. In fact, the specific question that Mr. Yudkowsky was responding to is: "What are the best old, wrong theories of mind/cognition/mental faculties that, if taken to be true for different magical beings, would make for the most interesting characters or civilizations?"

OP's question in this thread is this: Why would failing the course prevent a goblin from working in Gringotts? What useful skills would it teach them? What problems would it help them avoid?
:PROPERTIES:
:Author: Anakiri
:Score: 12
:DateUnix: 1529672770.0
:END:

*********** #+begin_quote
  You are aware that you are in [[/r/rational]], not [[/r/hpmor]], yes?
#+end_quote

Sure, and HPMoR is frequently discussed in both.

#+begin_quote
  Even the original statement wasn't about HPMoR.
#+end_quote

I missed that. It looked like it's a quote about HPMoR, and the OP didn't link to the original context. Sorry.

OK, that's basically a fantasy application of "humans are special" (TVtropes link left out). There's no end of stories about the elves being incapable of lying or bound by their word or otherwise having artistically interesting cognitive defects, and humans taking advantage of that to win over them.

Personally I would have picked [[https://www.amazon.com/Origin-Consciousness-Breakdown-Bicameral-Mind/dp/0618057072][bicameralism]] as the defunct cognitive model. Bicameral elves would be REALLY interesting.

So I've pretty much covered the skill it would teach them, to keep track of previous statements and see if they are inconsistent... for extended discussions, or where you find an inconsistency, you'd have some kind of signal for a clerk to patch in and keep track of what you're hearing and make notes and prompt you to ask leading questions though a magical earphone...
:PROPERTIES:
:Author: ArgentStonecutter
:Score: 1
:DateUnix: 1529673757.0
:END:


********** #+begin_quote
  Permutation City was about his first book, so the climactic arc is kind of forced and kind of breaks consistency
#+end_quote

[[https://www.fanfiction.net/s/5389450/1/The-Finale-of-the-Ultimate-Meta-Mega-Crossover][You know, there is a fanfic...]]
:PROPERTIES:
:Author: FeepingCreature
:Score: 2
:DateUnix: 1529686002.0
:END:

*********** Yeh, I read that one, mere ages ago.
:PROPERTIES:
:Author: ArgentStonecutter
:Score: 2
:DateUnix: 1529686059.0
:END:


