posts/"Only humans can think in three levels of recursion, and all other magical races stop at 2." What are the implications of this.8szydz.html
<li><a id="orgf416660"></a>It&rsquo;s not that we <i>can&rsquo;t</i> go deeper intuitively, it&rsquo;s that it&rsquo;s impractical to go any deeper than a really good lie unless you can model the other person very well, since it&rsquo;s so easy to backfire. Simplest solution and all that. You&rsquo;re more likely to succeed with a good lie than with trying to convince someone you were trying to lie to them recursively.<br />
<div class="outline-text-6" id="text-1-1-1-1-1">
<p>
We usually figure out lies through body language and context, if you can control those well enough to lie there&rsquo;s no reason to go any deeper.
</p>

<p>
Say Alice is a good liar, Bob knows this. Alice seems to fumble in the lie, Bob knows she wouldn&rsquo;t do that. So the fumble must be intentional. Alice knows Bob knows she&rsquo;s a good liar, so he knows she wouldn&rsquo;t fumble except on purpose, so it can&rsquo;t be the obvious (that the car really is red and she&rsquo;s trying to convince him it&rsquo;s blue) since she knows he&rsquo;d see through that. At this point you enter a bunch of recursions where Bob is wondering how well she predicted how he interpreted what she did, and then decides to go one level above it&#x2026;unless she predicted <i>that</i>. Alice can&rsquo;t reasonably predict how Bob will think about this, so you basically just have it down to random chance.
</p>

<p>
By fumbling the lie intentionally, Alice gave away that she was trying to lie about something. She would have better odds of succeeding by just lying since Bob wouldn&rsquo;t have suspected anything.
</p>
<p>
:Author: EthanCC
:Score: 7
:DateUnix: 1529693602.0
</p>
</div>
</li>


<li><a id="orgca193f3"></a>If you only need a small amount of bookkeeping (&lt;5-9 items) you can do it without the paper once you jave learned the algorithm.<br />
<div class="outline-text-6" id="text-1-1-1-1-2">
<p>
Algorithms are learnable. You don&rsquo;t need to be Einstein to understand Relativity. They can be written down. They are not subject to the Interdict. This one would be taught at Gringotts in &rsquo;Humans 101&rsquo;.
</p>
<p>
:Author: ArgentStonecutter
:Score: 9
:DateUnix: 1529669176.0
</p>
</div>

<ol class="org-ol">
<li><a id="orgf56b2ec"></a>Indeed. You could write an interesting story about what mental mechanisms non-humans have to use to adapt to this difference. But you seem to be admitting that non-humans would, in fact, require some learned non-intuitive mechanisms. What would Humans 101 teach goblins that they should watch out for?<br />
<div class="outline-text-7" id="text-1-1-1-1-2-1">
</div>

<ol class="org-ol">
<li><a id="orgdb054a1"></a>Nothing is intuitive but the nipple. It&rsquo;s all learned.<br />
<div class="outline-text-8" id="text-1-1-1-1-2-1-1">
</div>

<ol class="org-ol">
<li><a id="org957347f"></a>Okay, but suppose that while different races <i>can</i> learn anything, humans find it much, much easier to learn about thinking about thinking about thinking about things than goblins do. Regardless of whether that&rsquo;s how it works in the real world, suppose you&rsquo;re writing about a world where that is how it works. Most goblins can&rsquo;t get their heads around third level recursion before they&rsquo;re college age. It&rsquo;s your job to set up the curriculum for that class. What do you say, on the first day of class, to convince your goblin students that they should care about third level recursion and higher, instead of dropping it in favor of easier and more interesting classes like Microeconomic Effects of Promissory Notes in Eighth Century Ruritania II?<br />
<div class="outline-text-9" id="text-1-1-1-1-2-1-1-1">
</div>

<ol class="org-ol">
<li><a id="orgddebc6c"></a>#+begin<sub>quote</sub><br />
<div class="outline-text-10" id="text-1-1-1-1-2-1-1-1-1">
<p>
  Regardless of whether that&rsquo;s how it works in the real world, suppose you&rsquo;re writing about a world where that is how it works.
#+end<sub>quote</sub>
</p>

<p>
My point, which I&rsquo;m trying to close in on, is that the HPMoR world seems to be one where the Strong C-T hypothesis holds, so it&rsquo;s not actually consistent with the way that world works.
</p>

<p>
If you want to read some rational stories set in a world where the strong C-T hypothesis is REALLY taken seriously, I suggest <i>Permutation City</i>, <i>Diaspora</i>, and <i>Schild&rsquo;s Ladder</i> by Greg Egan.
</p>

<p>
Permutation City was about his first book, so the climactic arc is kind of forced and kind of breaks consistency, but the Copy society and Solipsist Nation are fascinating. Diaspora and Schild&rsquo;s Ladder are totally solid (and the latter has some existential fridge horror that&rsquo;s worth the trip).
</p>

<p>
But assuming the counterfactual, that&rsquo;s easy: &ldquo;If you don&rsquo;t pass this course you can not work in any human-facing position in Gringotts.&rdquo;
</p>
<p>
:Author: ArgentStonecutter
:Score: 0
:DateUnix: 1529671496.0
</p>
</div>

<ol class="org-ol">
<li><a id="orgf81636d"></a>Ah&#x2026; You are aware that you are in <a href="file:///r/rational">file:///r/rational</a>, not <a href="file:///r/hpmor">file:///r/hpmor</a>, yes? Even the <a href="https://www.reddit.com/r/rational/comments/870yhg/bst_ways_to_make_mugglesmortals_interesting/dwa703i/">original statement</a> wasn&rsquo;t about HPMoR. It was just a hypothetical way that, in <i>any</i> story, an author could make a meaningful difference between humans and other magical races. In fact, the specific question that Mr. Yudkowsky was responding to is: &ldquo;What are the best old, wrong theories of mind/cognition/mental faculties that, if taken to be true for different magical beings, would make for the most interesting characters or civilizations?&rdquo;<br />
<div class="outline-text-11" id="text-1-1-1-1-2-1-1-1-1-1">
<p>
OP&rsquo;s question in this thread is this: Why would failing the course prevent a goblin from working in Gringotts? What useful skills would it teach them? What problems would it help them avoid?
</p>
<p>
:Author: Anakiri
:Score: 12
:DateUnix: 1529672770.0
</p>
</div>

<ol class="org-ol">
<li><a id="org8546f92"></a>#+begin<sub>quote</sub><br />
<div class="outline-text-12" id="text-1-1-1-1-2-1-1-1-1-1-1">
<p>
  You are aware that you are in <a href="file:///r/rational">file:///r/rational</a>, not <a href="file:///r/hpmor">file:///r/hpmor</a>, yes?
#+end<sub>quote</sub>
</p>

<p>
Sure, and HPMoR is frequently discussed in both.
</p>

<blockquote>
<p>
Even the original statement wasn&rsquo;t about HPMoR.
</p>
</blockquote>

<p>
I missed that. It looked like it&rsquo;s a quote about HPMoR, and the OP didn&rsquo;t link to the original context. Sorry.
</p>

<p>
OK, that&rsquo;s basically a fantasy application of &ldquo;humans are special&rdquo; (TVtropes link left out). There&rsquo;s no end of stories about the elves being incapable of lying or bound by their word or otherwise having artistically interesting cognitive defects, and humans taking advantage of that to win over them.
</p>

<p>
Personally I would have picked <a href="https://www.amazon.com/Origin-Consciousness-Breakdown-Bicameral-Mind/dp/0618057072">bicameralism</a> as the defunct cognitive model. Bicameral elves would be REALLY interesting.
</p>

<p>
So I&rsquo;ve pretty much covered the skill it would teach them, to keep track of previous statements and see if they are inconsistent&#x2026; for extended discussions, or where you find an inconsistency, you&rsquo;d have some kind of signal for a clerk to patch in and keep track of what you&rsquo;re hearing and make notes and prompt you to ask leading questions though a magical earphone&#x2026;
</p>
<p>
:Author: ArgentStonecutter
:Score: 1
:DateUnix: 1529673757.0
</p>
</div>
</li>
</ol>
</li>


<li><a id="orga77887c"></a>#+begin<sub>quote</sub><br />
<div class="outline-text-11" id="text-1-1-1-1-2-1-1-1-1-2">
<p>
  Permutation City was about his first book, so the climactic arc is kind of forced and kind of breaks consistency
#+end<sub>quote</sub>
</p>

<p>
<a href="https://www.fanfiction.net/s/5389450/1/The-Finale-of-the-Ultimate-Meta-Mega-Crossover">You know, there is a fanfic&#x2026;</a>
</p>
<p>
:Author: FeepingCreature
:Score: 2
:DateUnix: 1529686002.0
</p>
</div>

<ol class="org-ol">
<li><a id="orge7e2f4a"></a>Yeh, I read that one, mere ages ago.<br />
<div class="outline-text-12" id="text-1-1-1-1-2-1-1-1-1-2-1">
</div>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
