"Only humans can think in three levels of recursion, and all other magical races stop at 2." What are the implications of this.8szydz.org
******** Maybe, but "intuitive" still has value as a qualifier; even though "intuitive" is subjective, there are still contexts (such as this discussion), where saying "A is more intuitive than B" conveys useful information.

Also re-using smart-sounding quotes without elaborating sucks.
:PROPERTIES:
:Author: CouteauBleu
:Score: 3
:DateUnix: 1529719043.0
:END:

********* The point is that everything is learned and pretty much everything you say is intuitive is something someone still needed to have explained.
:PROPERTIES:
:Author: ArgentStonecutter
:Score: 1
:DateUnix: 1529749442.0
:END:

********** That's a narrow way to think about learning.

In practice, given a group of people X, you can find concepts that these people have an easier time understanding, because most people in group X already have experience dealing with similar concepts or have thinking patterns that adapt well to them. These concepts could reasonably be designated as "intuitive" or "intuitive to group X".

In the context of this thread, Anakiri is saying that humans would have an advantage over elves, because they'd be able to create and spot complex multi-layered lies "intuitively" (as in, in the case of most humans, without needing to spend a lot of time/effort learning it), whereas elves would need to spend much more time training to keep up with human deceptions, and only long-trained elves could do it without a mental effort (the same way skilled mathematicians start internalizing complex math concepts on a gut level after a while).

As an aside, I really don't like the "Nothing but the nipple" quote (especially when discussing UI) because it erases a lot of that nuance. In practice, people aren't Turing machines, and they deal with some concepts better than others. Saying "but /really/, nothing is /actually/ intuitive because everyone learns at some point" is often pedantic, the same way epistemological nihilism (eg "your point about ethics is invalid because morality is subjective anyway") is often pedantic.
:PROPERTIES:
:Author: CouteauBleu
:Score: 4
:DateUnix: 1529757503.0
:END:

*********** In reality, you generally need trained /humans/ to detect double agents, otherwise they wouldn't be a thing. In reality, humans mostly can't detect simple single-layered lies, and have all kinds of weird deficits when you do simple stuff like repeating the same lie over and over again. They need actual training to deal with that.

How about a fantasy world where humans didn't have that problem, and the "big lie" didn't work on them?

Or one where humans didn't need 50,000 years to develop the scientific method?

One where humans are inherently rational?
:PROPERTIES:
:Author: ArgentStonecutter
:Score: 0
:DateUnix: 1529758475.0
:END:


***** #+begin_quote
  If Alice is a known competent liar, then it might not even occur to human-Bob that Alice might be having an off day - the car is definitely not blue.
#+end_quote

Unless that is just what Alice wants you to think.
:PROPERTIES:
:Author: MrCogmor
:Score: 2
:DateUnix: 1529831353.0
:END:


**** You're thinking like a human. The premise is that only humans can keep track of those pieces of information.
:PROPERTIES:
:Author: Lightwavers
:Score: 4
:DateUnix: 1529664795.0
:END:

***** Keeping track of information you can't keep track of with just your brain is what writing is basically about. That's the whole point. You'd have to make your non-humans inherently illiterate, and... no, I can't imagine the kind of cognitive shortcomings that would result from this kind of limitation. It would make Binns seem normal.
:PROPERTIES:
:Author: ArgentStonecutter
:Score: 7
:DateUnix: 1529665139.0
:END:

****** I don't think you're understanding what's going on here. Yes, a nonhuman would be able to figure this out with pen and paper, but it seems the practical implications that matter are the ones in the moment. Bob could determine Alice wants Bob to think she's lying if he thought it through and wrote out the steps, but intuitively he wouldn't realize it. It would take him a long time and some clues to figure it out, if he ever did. The thing with making up nonexistent races with different thought processes is that you have to entertain that they think differently than we do. If that means functional illiteracy (which this doesn't), then so be it.
:PROPERTIES:
:Author: Lightwavers
:Score: 7
:DateUnix: 1529665486.0
:END:

******* #+begin_quote
  Bob could determine Alice wants Bob to think she's lying if he thought it through and wrote out the steps, but intuitively he wouldn't realize it.
#+end_quote

These are not distinct concepts.

Humans can think about all kinds of things that are counter-intuitive. They can even win Nobel Prizes for it.

#+begin_quote
  It would take him a long time and some clues to figure it out, if he ever did.
#+end_quote

There are about a zillion and a half rational/rationalist/rationaloid stories where the hero goes "wait a minute" and sits down and draws game-theory diagrams to solve a problem, and nobody goes "see, humans can't think about game theory" because it was too much to keep track of without using a diagram and taking a long time.
:PROPERTIES:
:Author: ArgentStonecutter
:Score: 2
:DateUnix: 1529665892.0
:END:

******** You are misunderstanding it, I think. I don't think a rationalist Bob couldn't sit down a draw out everything that happened and figure out she wanted him to think she was lying. Uneducated peasant Bob probably would not though.
:PROPERTIES:
:Author: Lightwavers
:Score: 7
:DateUnix: 1529666187.0
:END:

********* Uneducated peasant Bob is functionally illiterate.
:PROPERTIES:
:Author: ArgentStonecutter
:Score: 5
:DateUnix: 1529666944.0
:END:

********** Haha, you got me there. Alright, he knows how to write but isn't in any way a rationalist. No need to be too pedantic. :P
:PROPERTIES:
:Author: Lightwavers
:Score: 3
:DateUnix: 1529667389.0
:END:


******** Do you understand the practical difference between seeing something immediately, while you're conversing, as in 2+2, and having to think about it, as in 14324 + 9812?
:PROPERTIES:
:Author: King_of_Men
:Score: 5
:DateUnix: 1529728633.0
:END:

********* Sure, but that happens anyway, within members of the same species.
:PROPERTIES:
:Author: ArgentStonecutter
:Score: 0
:DateUnix: 1529749291.0
:END:

********** I do not understand what point you are making.
:PROPERTIES:
:Author: King_of_Men
:Score: 3
:DateUnix: 1529814411.0
:END:


