posts/"Only humans can think in three levels of recursion, and all other magical races stop at 2." What are the implications of this.8szydz.html


<li><a id="orgd130987"></a>Maybe, but &ldquo;intuitive&rdquo; still has value as a qualifier; even though &ldquo;intuitive&rdquo; is subjective, there are still contexts (such as this discussion), where saying &ldquo;A is more intuitive than B&rdquo; conveys useful information.<br />
<div class="outline-text-9" id="text-1-1-1-1-2-1-1-2">
<p>
Also re-using smart-sounding quotes without elaborating sucks.
</p>
<p>
:Author: CouteauBleu
:Score: 3
:DateUnix: 1529719043.0
</p>
</div>

<ol class="org-ol">
<li><a id="org099bb54"></a>The point is that everything is learned and pretty much everything you say is intuitive is something someone still needed to have explained.<br />
<div class="outline-text-10" id="text-1-1-1-1-2-1-1-2-1">
</div>

<ol class="org-ol">
<li><a id="orgd70ea68"></a>That&rsquo;s a narrow way to think about learning.<br />
<div class="outline-text-11" id="text-1-1-1-1-2-1-1-2-1-1">
<p>
In practice, given a group of people X, you can find concepts that these people have an easier time understanding, because most people in group X already have experience dealing with similar concepts or have thinking patterns that adapt well to them. These concepts could reasonably be designated as &ldquo;intuitive&rdquo; or &ldquo;intuitive to group X&rdquo;.
</p>

<p>
In the context of this thread, Anakiri is saying that humans would have an advantage over elves, because they&rsquo;d be able to create and spot complex multi-layered lies &ldquo;intuitively&rdquo; (as in, in the case of most humans, without needing to spend a lot of time/effort learning it), whereas elves would need to spend much more time training to keep up with human deceptions, and only long-trained elves could do it without a mental effort (the same way skilled mathematicians start internalizing complex math concepts on a gut level after a while).
</p>

<p>
As an aside, I really don&rsquo;t like the &ldquo;Nothing but the nipple&rdquo; quote (especially when discussing UI) because it erases a lot of that nuance. In practice, people aren&rsquo;t Turing machines, and they deal with some concepts better than others. Saying &ldquo;but <i>really</i>, nothing is <i>actually</i> intuitive because everyone learns at some point&rdquo; is often pedantic, the same way epistemological nihilism (eg &ldquo;your point about ethics is invalid because morality is subjective anyway&rdquo;) is often pedantic.
</p>
<p>
:Author: CouteauBleu
:Score: 4
:DateUnix: 1529757503.0
</p>
</div>

<ol class="org-ol">
<li><a id="orgfef443a"></a>In reality, you generally need trained <i>humans</i> to detect double agents, otherwise they wouldn&rsquo;t be a thing. In reality, humans mostly can&rsquo;t detect simple single-layered lies, and have all kinds of weird deficits when you do simple stuff like repeating the same lie over and over again. They need actual training to deal with that.<br />
<div class="outline-text-12" id="text-1-1-1-1-2-1-1-2-1-1-1">
<p>
How about a fantasy world where humans didn&rsquo;t have that problem, and the &ldquo;big lie&rdquo; didn&rsquo;t work on them?
</p>

<p>
Or one where humans didn&rsquo;t need 50,000 years to develop the scientific method?
</p>

<p>
One where humans are inherently rational?
</p>
<p>
:Author: ArgentStonecutter
:Score: 0
:DateUnix: 1529758475.0
</p>
</div>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>


<li><a id="org729d235"></a>#+begin<sub>quote</sub><br />
<div class="outline-text-6" id="text-1-1-1-1-3">
<p>
  If Alice is a known competent liar, then it might not even occur to human-Bob that Alice might be having an off day - the car is definitely not blue.
#+end<sub>quote</sub>
</p>

<p>
Unless that is just what Alice wants you to think.
</p>
<p>
:Author: MrCogmor
:Score: 2
:DateUnix: 1529831353.0
</p>
</div>
</li>
</ol>
</li>


<li><a id="orgc2a892a"></a>You&rsquo;re thinking like a human. The premise is that only humans can keep track of those pieces of information.<br />
<div class="outline-text-5" id="text-1-1-1-2">
</div>

<ol class="org-ol">
<li><a id="orgb1acf76"></a>Keeping track of information you can&rsquo;t keep track of with just your brain is what writing is basically about. That&rsquo;s the whole point. You&rsquo;d have to make your non-humans inherently illiterate, and&#x2026; no, I can&rsquo;t imagine the kind of cognitive shortcomings that would result from this kind of limitation. It would make Binns seem normal.<br />
<div class="outline-text-6" id="text-1-1-1-2-1">
</div>

<ol class="org-ol">
<li><a id="org2fd7a08"></a>I don&rsquo;t think you&rsquo;re understanding what&rsquo;s going on here. Yes, a nonhuman would be able to figure this out with pen and paper, but it seems the practical implications that matter are the ones in the moment. Bob could determine Alice wants Bob to think she&rsquo;s lying if he thought it through and wrote out the steps, but intuitively he wouldn&rsquo;t realize it. It would take him a long time and some clues to figure it out, if he ever did. The thing with making up nonexistent races with different thought processes is that you have to entertain that they think differently than we do. If that means functional illiteracy (which this doesn&rsquo;t), then so be it.<br />
<div class="outline-text-7" id="text-1-1-1-2-1-1">
</div>

<ol class="org-ol">
<li><a id="org94a3a0e"></a>#+begin<sub>quote</sub><br />
<div class="outline-text-8" id="text-1-1-1-2-1-1-1">
<p>
  Bob could determine Alice wants Bob to think she&rsquo;s lying if he thought it through and wrote out the steps, but intuitively he wouldn&rsquo;t realize it.
#+end<sub>quote</sub>
</p>

<p>
These are not distinct concepts.
</p>

<p>
Humans can think about all kinds of things that are counter-intuitive. They can even win Nobel Prizes for it.
</p>

<blockquote>
<p>
It would take him a long time and some clues to figure it out, if he ever did.
</p>
</blockquote>

<p>
There are about a zillion and a half rational/rationalist/rationaloid stories where the hero goes &ldquo;wait a minute&rdquo; and sits down and draws game-theory diagrams to solve a problem, and nobody goes &ldquo;see, humans can&rsquo;t think about game theory&rdquo; because it was too much to keep track of without using a diagram and taking a long time.
</p>
<p>
:Author: ArgentStonecutter
:Score: 2
:DateUnix: 1529665892.0
</p>
</div>

<ol class="org-ol">
<li><a id="org76d5f7f"></a>You are misunderstanding it, I think. I don&rsquo;t think a rationalist Bob couldn&rsquo;t sit down a draw out everything that happened and figure out she wanted him to think she was lying. Uneducated peasant Bob probably would not though.<br />
<div class="outline-text-9" id="text-1-1-1-2-1-1-1-1">
</div>

<ol class="org-ol">
<li><a id="orgaac6c9a"></a>Uneducated peasant Bob is functionally illiterate.<br />
<div class="outline-text-10" id="text-1-1-1-2-1-1-1-1-1">
</div>

<ol class="org-ol">
<li><a id="org2cde83f"></a>Haha, you got me there. Alright, he knows how to write but isn&rsquo;t in any way a rationalist. No need to be too pedantic. :P<br />
<div class="outline-text-11" id="text-1-1-1-2-1-1-1-1-1-1">
</div>
</li>
</ol>
</li>
</ol>
</li>


<li><a id="org4d6224c"></a>Do you understand the practical difference between seeing something immediately, while you&rsquo;re conversing, as in 2+2, and having to think about it, as in 14324 + 9812?<br />
<div class="outline-text-9" id="text-1-1-1-2-1-1-1-2">
</div>

<ol class="org-ol">
<li><a id="orgbf5efd0"></a>Sure, but that happens anyway, within members of the same species.<br />
<div class="outline-text-10" id="text-1-1-1-2-1-1-1-2-1">
</div>

<ol class="org-ol">
<li><a id="orga65b9f0"></a>I do not understand what point you are making.<br />
<div class="outline-text-11" id="text-1-1-1-2-1-1-1-2-1-1">
</div>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</div>
