"Only humans can think in three levels of recursion, and all other magical races stop at 2." What are the implications of this.8szydz.org
*** #+begin_quote
  Magical races can use spies and informants, but only humans can use double agents. Only humans can even think about the concept of double agents, without going cross-eyed and needing to work it out on paper.
#+end_quote

Triple agents, actually.

0: Bob works as an intelligence analyst for the CIA.

1: Bob is a mole recruited by Russia who got a placed as an intelligence analyst in the CIA.

2: Bob is a double-agent, a mole recruited by Russia who notified the CIA and began working for them to relay false intelligence back to Russia.

3: Bob is a triple-agent, a mole recruited by Russia who notified the CIA and pretended to begin working for them as an intelligence analyst in order to relay false intelligence back to Russia, but then became a defector for China and now relays Chinese deceptions about US intelligence to Russia, while getting paid by all three countries.
:PROPERTIES:
:Author: Norseman2
:Score: 4
:DateUnix: 1529683241.0
:END:

**** No, your examples go: agent, double agent, triple agent, quadruple agent. A Russian spy in CIA is already a double agent:

- (agent, recursion 1) works for cause A;

- (double-agent, 2) pretends to work for cause A, works for cause B;

- (triple-agent, 3) pretends to pretend to work for cause A, pretends to work for cause B, works for cause A;

- (quadruple-agent, 4) pretends to pretend to pretend to work for cause A, pretends to pretend to work for cause B, pretends to work for cause A, works for cause B.

Recursion here means the number of relations with a particular concept ("cause"). An agent has one relation [agent] → [cause]. A double-agent has two: [agent] → ← [cause], triple-agent has three: [agent] → ← → [cause], and so on. If you treat arrows as vectors and sum them, you would see that agents and triple-agents work for the cause, whereas a double-agent doesn't.

Another way of looking at it is, an intelligence agent is expected to model/predict the behaviour of the agency's enemies, which is already recursion 1. Double-agent thinks at recursion 2, and triple-agent thinks at recursion 3.

Humans aren't usually able to be quadruple-agents, which means non-humans wouldn't be able to be triple-agents, i. e. be fake defectors.
:PROPERTIES:
:Author: Noumero
:Score: 6
:DateUnix: 1529690023.0
:END:

***** #+begin_quote
  A Russian spy in CIA is already a double agent.
#+end_quote

No. A spy, or agent, is someone who betrays their home country by giving secret information to a foreign country. A [[https://en.wikipedia.org/wiki/Double_agent][double agent]] is a spy who has reversed their allegiance back to their home country and is feeding false information to the foreign country. An intelligence analyst is a a desk jockey with a security clearance, and not a spy unless they happen to be abusing that security clearance.
:PROPERTIES:
:Author: Norseman2
:Score: 5
:DateUnix: 1529694958.0
:END:

****** Hmm. Yes, you're right, I misread this definition.

The terminology seems confusing, though. A spy visibly works for one organization, but in actuality works for another. From the perspective of the first organization, their agent/worker is betraying them to another party. Why wouldn't this agent be termed a double-agent?

... Because the definition of the term "agent" used by intelligence services is different from the definition of the term "agent" used by game theory, isn't it.
:PROPERTIES:
:Author: Noumero
:Score: 5
:DateUnix: 1529696231.0
:END:


**** Even if they mostly work at the object level, a CIA intelligence analyst is expected to be able to figure out what Russia knows about things. I'd say that you need at least one level of recursion to even be in the field with any success.
:PROPERTIES:
:Author: Anakiri
:Score: 2
:DateUnix: 1529684615.0
:END:

***** Sure, but should be looking at it from an outside point of view, not from the spy's point of view. At face value, Bob is an intelligence analyst as far as his coworkers are aware. His Russian recruiter goes a level or two deeper, knowing he's a mole and wondering if he has become a double agent. His American boss goes two or three steps deep, knowing he's a double agent and wondering if his loyalties actually still lie with his home country. His Chinese handler goes three or four steps deep, knowing he's a defected double-agent, and wondering if he's had opportunities to start collecting money from other countries as well.
:PROPERTIES:
:Author: Norseman2
:Score: 2
:DateUnix: 1529685304.0
:END:

****** Hmm... Yes, that's fair. I believe you are correct that magical races likely could understand the concept of double agents. Though I suspect that only humans would be able to use them effectively in practice.
:PROPERTIES:
:Author: Anakiri
:Score: 1
:DateUnix: 1529685629.0
:END:


**** HPMOR fandom is the only place I've ever heard triple/quadruple agent used to refer to three or more separate influencing parties. In other contexts, I've heard it used to refer to the same two parties repeatedly. I wonder if there are other terms to clarify this?
:PROPERTIES:
:Author: sparr
:Score: 2
:DateUnix: 1529689801.0
:END:


*** This makes sense. Thanks for entertaining the scenario.
:PROPERTIES:
:Author: Lightwavers
:Score: 2
:DateUnix: 1529664748.0
:END:


** This idea is inspired from a quote "in practice, infinite recursions are at most three levels deep."

The zero level is generic statements about the world around us such as 'the sky is blue' and 'Alice is a nice woman'.

The first level is any statement/reflections about yourself which includes statements like 'I (Bob) am a nice guy' or 'I (Bob) like Alice'. A common question of the first level is "What do I think of myself?" or "What do I think about other people?"

The second level is any statement about other people's conceptions about yourself or another person. For example, 'Alice thinks I'm not so nice' or 'Alice thinks Carl is nice'. A common question of the second level is "What does Alice think about me (Bob)?" or "What does Alice think about Carl?"

The third level is any statement/thought about another person's thoughts about what they think of someone else. For example, "Alice thinks Bob believes Carl is rude', 'Bob thinks Alice thinks he is attracted to her', and 'Carl thinks Bob thinks Carl wants to date Alice'. A common question of the third level is "What does Alice think I (Bob) think about Alice?"

The first level is a model of your own mind. The second level requires you to have a model of other people's minds to reason about how they think about you. The third level is required to have models of how other people are modeling your thoughts.

In this way, the magical races can reason about themselves and how other people think about the people around them. But without the third level, you can't know how other people think /you/ think. The third level is required to lie or bluff convincingly. Without it, you can't model how other people will react to your lies.
:PROPERTIES:
:Author: xamueljones
:Score: 24
:DateUnix: 1529694562.0
:END:

