posts/"Only humans can think in three levels of recursion, and all other magical races stop at 2." What are the implications of this.8szydz.html


<div id="outline-container-orgdda91cd" class="outline-4">
<h4 id="orgdda91cd"><span class="section-number-4">1.1.2</span> #+begin<sub>quote</sub></h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
  Magical races can use spies and informants, but only humans can use double agents. Only humans can even think about the concept of double agents, without going cross-eyed and needing to work it out on paper.
#+end<sub>quote</sub>
</p>

<p>
Triple agents, actually.
</p>

<p>
0: Bob works as an intelligence analyst for the CIA.
</p>

<p>
1: Bob is a mole recruited by Russia who got a placed as an intelligence analyst in the CIA.
</p>

<p>
2: Bob is a double-agent, a mole recruited by Russia who notified the CIA and began working for them to relay false intelligence back to Russia.
</p>

<p>
3: Bob is a triple-agent, a mole recruited by Russia who notified the CIA and pretended to begin working for them as an intelligence analyst in order to relay false intelligence back to Russia, but then became a defector for China and now relays Chinese deceptions about US intelligence to Russia, while getting paid by all three countries.
</p>
<p>
:Author: Norseman2
:Score: 4
:DateUnix: 1529683241.0
</p>
</div>

<ol class="org-ol">
<li><a id="org10f8d53"></a>No, your examples go: agent, double agent, triple agent, quadruple agent. A Russian spy in CIA is already a double agent:<br />
<div class="outline-text-5" id="text-1-1-2-1">
<ul class="org-ul">
<li>(agent, recursion 1) works for cause A;</li>

<li>(double-agent, 2) pretends to work for cause A, works for cause B;</li>

<li>(triple-agent, 3) pretends to pretend to work for cause A, pretends to work for cause B, works for cause A;</li>

<li>(quadruple-agent, 4) pretends to pretend to pretend to work for cause A, pretends to pretend to work for cause B, pretends to work for cause A, works for cause B.</li>
</ul>

<p>
Recursion here means the number of relations with a particular concept (&ldquo;cause&rdquo;). An agent has one relation [agent] → [cause]. A double-agent has two: [agent] → ← [cause], triple-agent has three: [agent] → ← → [cause], and so on. If you treat arrows as vectors and sum them, you would see that agents and triple-agents work for the cause, whereas a double-agent doesn&rsquo;t.
</p>

<p>
Another way of looking at it is, an intelligence agent is expected to model/predict the behaviour of the agency&rsquo;s enemies, which is already recursion 1. Double-agent thinks at recursion 2, and triple-agent thinks at recursion 3.
</p>

<p>
Humans aren&rsquo;t usually able to be quadruple-agents, which means non-humans wouldn&rsquo;t be able to be triple-agents, i. e. be fake defectors.
</p>
<p>
:Author: Noumero
:Score: 6
:DateUnix: 1529690023.0
</p>
</div>

<ol class="org-ol">
<li><a id="org8d28ee6"></a>#+begin<sub>quote</sub><br />
<div class="outline-text-6" id="text-1-1-2-1-1">
<p>
  A Russian spy in CIA is already a double agent.
#+end<sub>quote</sub>
</p>

<p>
No. A spy, or agent, is someone who betrays their home country by giving secret information to a foreign country. A <a href="https://en.wikipedia.org/wiki/Double_agent">double agent</a> is a spy who has reversed their allegiance back to their home country and is feeding false information to the foreign country. An intelligence analyst is a a desk jockey with a security clearance, and not a spy unless they happen to be abusing that security clearance.
</p>
<p>
:Author: Norseman2
:Score: 5
:DateUnix: 1529694958.0
</p>
</div>

<ol class="org-ol">
<li><a id="org1fc7bb9"></a>Hmm. Yes, you&rsquo;re right, I misread this definition.<br />
<div class="outline-text-7" id="text-1-1-2-1-1-1">
<p>
The terminology seems confusing, though. A spy visibly works for one organization, but in actuality works for another. From the perspective of the first organization, their agent/worker is betraying them to another party. Why wouldn&rsquo;t this agent be termed a double-agent?
</p>

<p>
&#x2026; Because the definition of the term &ldquo;agent&rdquo; used by intelligence services is different from the definition of the term &ldquo;agent&rdquo; used by game theory, isn&rsquo;t it.
</p>
<p>
:Author: Noumero
:Score: 5
:DateUnix: 1529696231.0
</p>
</div>
</li>
</ol>
</li>
</ol>
</li>


<li><a id="org7a795b8"></a>Even if they mostly work at the object level, a CIA intelligence analyst is expected to be able to figure out what Russia knows about things. I&rsquo;d say that you need at least one level of recursion to even be in the field with any success.<br />
<div class="outline-text-5" id="text-1-1-2-2">
</div>

<ol class="org-ol">
<li><a id="org6c0031a"></a>Sure, but should be looking at it from an outside point of view, not from the spy&rsquo;s point of view. At face value, Bob is an intelligence analyst as far as his coworkers are aware. His Russian recruiter goes a level or two deeper, knowing he&rsquo;s a mole and wondering if he has become a double agent. His American boss goes two or three steps deep, knowing he&rsquo;s a double agent and wondering if his loyalties actually still lie with his home country. His Chinese handler goes three or four steps deep, knowing he&rsquo;s a defected double-agent, and wondering if he&rsquo;s had opportunities to start collecting money from other countries as well.<br />
<div class="outline-text-6" id="text-1-1-2-2-1">
</div>

<ol class="org-ol">
<li><a id="orgeab06f0"></a>Hmm&#x2026; Yes, that&rsquo;s fair. I believe you are correct that magical races likely could understand the concept of double agents. Though I suspect that only humans would be able to use them effectively in practice.<br />
<div class="outline-text-7" id="text-1-1-2-2-1-1">
</div>
</li>
</ol>
</li>
</ol>
</li>


<li><a id="org7b55923"></a>HPMOR fandom is the only place I&rsquo;ve ever heard triple/quadruple agent used to refer to three or more separate influencing parties. In other contexts, I&rsquo;ve heard it used to refer to the same two parties repeatedly. I wonder if there are other terms to clarify this?<br />
<div class="outline-text-5" id="text-1-1-2-3">
</div>
</li>
</ol>
</div>


<div id="outline-container-orga0ab738" class="outline-4">
<h4 id="orga0ab738"><span class="section-number-4">1.1.3</span> This makes sense. Thanks for entertaining the scenario.</h4>
<div class="outline-text-4" id="text-1-1-3">
</div>
</div>
</div>


<div id="outline-container-org8cedb96" class="outline-3">
<h3 id="org8cedb96"><span class="section-number-3">1.2</span> This idea is inspired from a quote &ldquo;in practice, infinite recursions are at most three levels deep.&rdquo;</h3>
<div class="outline-text-3" id="text-1-2">
<p>
The zero level is generic statements about the world around us such as &rsquo;the sky is blue&rsquo; and &rsquo;Alice is a nice woman&rsquo;.
</p>

<p>
The first level is any statement/reflections about yourself which includes statements like &rsquo;I (Bob) am a nice guy&rsquo; or &rsquo;I (Bob) like Alice&rsquo;. A common question of the first level is &ldquo;What do I think of myself?&rdquo; or &ldquo;What do I think about other people?&rdquo;
</p>

<p>
The second level is any statement about other people&rsquo;s conceptions about yourself or another person. For example, &rsquo;Alice thinks I&rsquo;m not so nice&rsquo; or &rsquo;Alice thinks Carl is nice&rsquo;. A common question of the second level is &ldquo;What does Alice think about me (Bob)?&rdquo; or &ldquo;What does Alice think about Carl?&rdquo;
</p>

<p>
The third level is any statement/thought about another person&rsquo;s thoughts about what they think of someone else. For example, &ldquo;Alice thinks Bob believes Carl is rude&rsquo;, &lsquo;Bob thinks Alice thinks he is attracted to her&rsquo;, and &lsquo;Carl thinks Bob thinks Carl wants to date Alice&rsquo;. A common question of the third level is &rdquo;What does Alice think I (Bob) think about Alice?&ldquo;
</p>

<p>
The first level is a model of your own mind. The second level requires you to have a model of other people&rsquo;s minds to reason about how they think about you. The third level is required to have models of how other people are modeling your thoughts.
</p>

<p>
In this way, the magical races can reason about themselves and how other people think about the people around them. But without the third level, you can&rsquo;t know how other people think <i>you</i> think. The third level is required to lie or bluff convincingly. Without it, you can&rsquo;t model how other people will react to your lies.
</p>
<p>
:Author: xamueljones
:Score: 24
:DateUnix: 1529694562.0
</p>
</div>
