"Only humans can think in three levels of recursion, and all other magical races stop at 2." What are the implications of this.8szydz.org
*** Aaah, thanks. I like this explanation. So humans would be master liars, and no one else would no what was going on.
:PROPERTIES:
:Author: Lightwavers
:Score: 2
:DateUnix: 1529706784.0
:END:


** This is not technically a computational limitation in cognition. Anything you can do with recursion you can do with iteration and some book-keeping. Ink and paper and Bob's your uncle.
:PROPERTIES:
:Author: ArgentStonecutter
:Score: 6
:DateUnix: 1529659691.0
:END:

*** Alright, but let's instate a fascist government and burn all the books. What does three levels of recursion actually allow you to do that you can't with just two? I cannot think of a single practical thing.
:PROPERTIES:
:Author: Lightwavers
:Score: 3
:DateUnix: 1529659886.0
:END:

**** #+begin_quote
  Alright, but let's instate a fascist government and burn all the books.
#+end_quote

Let's have a fascist government that drugs everyone, like in Brave New World... burning all the books would also have a huge impact on /human/ cognition. We're already using book-keeping to get around limitations in our own base computational structure. Literacy literally made us more intelligent.

However you figure it, I think this was just EY coming up with something that sounded good.
:PROPERTIES:
:Author: ArgentStonecutter
:Score: 8
:DateUnix: 1529659981.0
:END:

***** I'm having a hard time understanding what exactly you mean.

Alright, let's say that only humans are capable of sorting through three levels of recursion, even in text. Are you saying that in this scenario, there is no practical difference between human and nonhuman cognition?
:PROPERTIES:
:Author: Lightwavers
:Score: 3
:DateUnix: 1529660893.0
:END:

****** #+begin_quote
  I'm having a hard time understanding what exactly you mean.
#+end_quote

I'm saying you can prove anything given a counterfactual. They'd have to do more than burn all the books.

/And/ humans have limitations in our ability to perform computation... to process information... limitations in our cognition that /we/ bypass by bookkeeping. This would literally change the kinds of things humans could think about as well.

#+begin_quote
  Alright, let's say that only humans are capable of sorting through three levels of recursion, even in text.
#+end_quote

Pretty sure that breaks both Turing Equivalence and the Church-Turing Hypothesis, and I don't think that's what EY intended given the rest of HPMoR.
:PROPERTIES:
:Author: ArgentStonecutter
:Score: 2
:DateUnix: 1529663262.0
:END:

******* Work with me here? Give everyone, human and nonhuman alike, paper and pen. Assume nonhuman entities as unable to comprehend more than two levels of recursion, no matter how it's written down. Ignore how impossible this is, just roll with it.

What are the practical differences?
:PROPERTIES:
:Author: Lightwavers
:Score: 6
:DateUnix: 1529664600.0
:END:

