posts/"Only humans can think in three levels of recursion, and all other magical races stop at 2." What are the implications of this.8szydz.html

<div id="outline-container-orgf110782" class="outline-4">
<h4 id="orgf110782"><span class="section-number-4">1.2.1</span> Aaah, thanks. I like this explanation. So humans would be master liars, and no one else would no what was going on.</h4>
<div class="outline-text-4" id="text-1-2-1">
</div>
</div>
</div>


<div id="outline-container-org787bc3d" class="outline-3">
<h3 id="org787bc3d"><span class="section-number-3">1.3</span> This is not technically a computational limitation in cognition. Anything you can do with recursion you can do with iteration and some book-keeping. Ink and paper and Bob&rsquo;s your uncle.</h3>
<div class="outline-text-3" id="text-1-3">
</div>

<div id="outline-container-org107c926" class="outline-4">
<h4 id="org107c926"><span class="section-number-4">1.3.1</span> Alright, but let&rsquo;s instate a fascist government and burn all the books. What does three levels of recursion actually allow you to do that you can&rsquo;t with just two? I cannot think of a single practical thing.</h4>
<div class="outline-text-4" id="text-1-3-1">
</div>

<ol class="org-ol">
<li><a id="org34f927f"></a>#+begin<sub>quote</sub><br />
<div class="outline-text-5" id="text-1-3-1-1">
<p>
  Alright, but let&rsquo;s instate a fascist government and burn all the books.
#+end<sub>quote</sub>
</p>

<p>
Let&rsquo;s have a fascist government that drugs everyone, like in Brave New World&#x2026; burning all the books would also have a huge impact on <i>human</i> cognition. We&rsquo;re already using book-keeping to get around limitations in our own base computational structure. Literacy literally made us more intelligent.
</p>

<p>
However you figure it, I think this was just EY coming up with something that sounded good.
</p>
<p>
:Author: ArgentStonecutter
:Score: 8
:DateUnix: 1529659981.0
</p>
</div>

<ol class="org-ol">
<li><a id="orgda58364"></a>I&rsquo;m having a hard time understanding what exactly you mean.<br />
<div class="outline-text-6" id="text-1-3-1-1-1">
<p>
Alright, let&rsquo;s say that only humans are capable of sorting through three levels of recursion, even in text. Are you saying that in this scenario, there is no practical difference between human and nonhuman cognition?
</p>
<p>
:Author: Lightwavers
:Score: 3
:DateUnix: 1529660893.0
</p>
</div>

<ol class="org-ol">
<li><a id="org9f399ae"></a>#+begin<sub>quote</sub><br />
<div class="outline-text-7" id="text-1-3-1-1-1-1">
<p>
  I&rsquo;m having a hard time understanding what exactly you mean.
#+end<sub>quote</sub>
</p>

<p>
I&rsquo;m saying you can prove anything given a counterfactual. They&rsquo;d have to do more than burn all the books.
</p>

<p>
<i>And</i> humans have limitations in our ability to perform computation&#x2026; to process information&#x2026; limitations in our cognition that <i>we</i> bypass by bookkeeping. This would literally change the kinds of things humans could think about as well.
</p>

<blockquote>
<p>
Alright, let&rsquo;s say that only humans are capable of sorting through three levels of recursion, even in text.
</p>
</blockquote>

<p>
Pretty sure that breaks both Turing Equivalence and the Church-Turing Hypothesis, and I don&rsquo;t think that&rsquo;s what EY intended given the rest of HPMoR.
</p>
<p>
:Author: ArgentStonecutter
:Score: 2
:DateUnix: 1529663262.0
</p>
</div>

<ol class="org-ol">
<li><a id="org4bd0a48"></a>Work with me here? Give everyone, human and nonhuman alike, paper and pen. Assume nonhuman entities as unable to comprehend more than two levels of recursion, no matter how it&rsquo;s written down. Ignore how impossible this is, just roll with it.<br />
<div class="outline-text-8" id="text-1-3-1-1-1-1-1">
<p>
What are the practical differences?
</p>
<p>
:Author: Lightwavers
:Score: 6
:DateUnix: 1529664600.0
</p>
</div>

<ol class="org-ol">
