"Only humans can think in three levels of recursion, and all other magical races stop at 2." What are the implications of this.8szydz.org
******** You don't have to comprehend recursion to simulate it. You aren't thinking in terms of recursion, you're thinking in terms of iteration.

What you're talking about is some kind of memory limitation that can't be bypassed by reading and writing information in external memory. This amounts to functional illiteracy. Even something like "they can't recall more than two items they've read" wouldn't do it, because you could still build a Beowulf Cluster of Grendels. I'm not sure that a being so limited would be able to pass as a human in casual conversation.

So there's your answer.
:PROPERTIES:
:Author: ArgentStonecutter
:Score: 3
:DateUnix: 1529664783.0
:END:

********* I don't think you understand the difference between iteration and recursion. An iteration is a loop, a repetition, oftentimes with a variable changed each time. Recursion is taking a step back and calling a function within itself. So we take function thinking() and make it call function thinking() within itself, usually with something changed each iteration. An iteration is an important step in recursive functions, but while you need to iterate to recurse, iteration != recursion. Meanwhile, iterating function thinking() loops it continually. So you would be thinking about something, and then thinking about it again.
:PROPERTIES:
:Author: Lightwavers
:Score: 2
:DateUnix: 1529665255.0
:END:

********** #+begin_quote
  I don't think you understand the difference between iteration and recursion.
#+end_quote

I have been a professional computer programmer for almost 40 years. I wrote my first compiler in 1979. I have implemented at least a dozen arithmetic expression parsers (an inherently recursive algorithm) in Fortran (a language that doesn't support recursion). I know the difference between iteration and recursion. Given indexable storage they are Turing-equivalent operations.
:PROPERTIES:
:Author: ArgentStonecutter
:Score: 5
:DateUnix: 1529665451.0
:END:

*********** Fact: iteration is basically looping.

Fact: recursion is a function that calls itself each iteration.

Fact: you claim to know this.

Fact: you also claim that being unable to intuitively understand recursion at three levels is equivalent to being functionally illiterate.
:PROPERTIES:
:Author: Lightwavers
:Score: 2
:DateUnix: 1529665674.0
:END:

************ #+begin_quote
  Fact: iteration is basically looping.

  Fact: recursion is a function that calls itself each iteration.
#+end_quote

Iteration and recursion are both tools that can be used to implement a recursive algorithm. Therefore iteration with a simulated stack is equivalent to recursion. This is basic computational theory. This is literally what "Turing equivalence" means.

#+begin_quote
  Fact: you also claim that being unable to intuitively understand recursion at three levels is equivalent to being functionally illiterate.
#+end_quote

The claim that I made is "being unable to understand recursion at three levels given bookkeeping tools requires being functionally illiterate". You believe that the noise-word "intuitively" changes the meaning of this sentence.
:PROPERTIES:
:Author: ArgentStonecutter
:Score: 9
:DateUnix: 1529666911.0
:END:

************* #+begin_quote
  Iteration and recursion are both tools that can be used to implement a recursive algorithm.
#+end_quote

But this is false, yes? Iteration is a necessary part of a working recursive algorithm, and recursion is a word that encompasses everything a recursive algorithm is. They are not at all the same, as you can, for example, iterate through a list without recursing.

#+begin_quote
  The claim that I made is "being unable to understand recursion at three levels given bookkeeping tools requires being functionally illiterate".
#+end_quote

But the word 'intuitively' /does/ change the meaning of that sentence. If they are able to work it out in the end, but can't grasp it immediately, it puts an advantage on the person who can. Plus the one without intuition may not ever realize there was something to work out if they aren't that rational.
:PROPERTIES:
:Author: Lightwavers
:Score: 1
:DateUnix: 1529667634.0
:END:

************** No. Iteration with bookkeeping is turing-equivalent to recursion. You /can/ implement a Pascal interpreter in Fortran.

There are differences in how quickly people can think, regardless of artificial restrictions. Think of the difference between Goyle and Granger.
:PROPERTIES:
:Author: ArgentStonecutter
:Score: 3
:DateUnix: 1529669491.0
:END:

*************** I feel like allowing that to be called iteration is kind of muddying the words. Recursion has a specific meaning, right, and when it's allowed to mean the exact same thing as iteration, it kind of adds unnecessary confusion.

But that's off topic---people have biases. Why can't reducing be level of recursion that humans can intuitively think in by one for a magical race be hypothetically considered? No need to reduce the speed of thought.
:PROPERTIES:
:Author: Lightwavers
:Score: 2
:DateUnix: 1529670303.0
:END:

**************** #+begin_quote
  I feel like allowing that to be called iteration is kind of muddying the words.
#+end_quote

It's perfectly conventional computing theory. This kind of equivalence is actually kind of central to the whole structure of computing. No processor in the world implements "recursion" as a basic operation, they all put it together from iteration and bookkeeping.

The point is that this oddly specific deficit is probably computationally impossible, and violates the Strong Church-Turing Hypothesis. Which I'm pretty sure EY didn't intend. It was a throwaway line that sounds good, but it's not essential, and can be treated as a minor oops.
:PROPERTIES:
:Author: ArgentStonecutter
:Score: 7
:DateUnix: 1529670830.0
:END:

***************** But fantasy breaks physics all the time. Just rolling with it, i think it's a pretty cool idea.
:PROPERTIES:
:Author: Lightwavers
:Score: 1
:DateUnix: 1529706535.0
:END:

****************** Fantasy or not, you can't argue that the computational equivalence of iteration+bookkeeping to recursion is "muddying the words".
:PROPERTIES:
:Author: ArgentStonecutter
:Score: 2
:DateUnix: 1529706885.0
:END:

******************* Why not? In those very soecifics cases where it matters that deep down, they are both the same thing, then sure, point that out. But in all other cases, recursion and iteration both have specific definitions that do not mean the same thing.
:PROPERTIES:
:Author: Lightwavers
:Score: 1
:DateUnix: 1529706997.0
:END:

******************** Because minds are computational structures.
:PROPERTIES:
:Author: ArgentStonecutter
:Score: 1
:DateUnix: 1529708560.0
:END:

********************* Right, but right now we're talking about definitions, so that's kind of a non sequitur.
:PROPERTIES:
:Author: Lightwavers
:Score: 1
:DateUnix: 1529709012.0
:END:

********************** We're talking about minds. Whatever. [[http://metamagician3000.blogspot.com/2009/09/interview-with-greg-egan.html][Let me leave you with a quote from Greg Egan]]:

#+begin_quote
  I believe that humans have already crossed a threshold that, in a certain sense, puts us on an equal footing with any other being who has mastered abstract reasoning. There's a notion in computing science of “Turing completeness”, which says that once a computer can perform a set of quite basic operations, it can be programmed to do absolutely any calculation that any other computer can do. Other computers might be faster, or have more memory, or have multiple processors running at the same time, but my 1988 Amiga 500 really could be programmed to do anything my 2008 iMac can do --- apart from responding to external events in real time --- if only I had the patience to sit and swap floppy disks all day long. I suspect that something broadly similar applies to minds and the class of things they can understand: other beings might think faster than us, or have easy access to a greater store of facts, but underlying both mental processes will be the same basic set of general-purpose tools. So if we ever did encounter those billion-year-old aliens, I'm sure they'd have plenty to tell us that we didn't yet know --- but given enough patience, and a very large notebook, I believe we'd still be able to come to grips with whatever they had to say.
#+end_quote
:PROPERTIES:
:Author: ArgentStonecutter
:Score: 1
:DateUnix: 1529709307.0
:END:

*********************** Yes, that's true. However, to simplify things and be more accurate, how about we refer to the words recursion and iteration as they are dictionarily defined, rather than being technically correct but overly pedantic about it?
:PROPERTIES:
:Author: Lightwavers
:Score: 1
:DateUnix: 1529714776.0
:END:

************************ Because we are explicitly talking about technical limitations of computation. The actual technical meanings /are/ the relevant ones.
:PROPERTIES:
:Author: ArgentStonecutter
:Score: 1
:DateUnix: 1529749555.0
:END:

************************* We're talking the practical consequences of limited computation in a certain, hypothesized subset of a nonexistent population where nothing except the actual real world effects matter.
:PROPERTIES:
:Author: Lightwavers
:Score: 1
:DateUnix: 1529750553.0
:END:

************************** And I'm saying they can still learn to perform that computation, regardless of the hypothetical deficit. This is not about the definitions. I'm not changing the definitions, I'm pointing out that the combination of capabilities they have is computationally equivalent.
:PROPERTIES:
:Author: ArgentStonecutter
:Score: 1
:DateUnix: 1529751027.0
:END:

*************************** Okay, yes but that's not the point. Sure, if they struggle long enough hey may be able to get it. But we're looking at the implications for a race that will not get it without practice and some working out.
:PROPERTIES:
:Author: Lightwavers
:Score: 1
:DateUnix: 1529751168.0
:END:

**************************** Recursion and Iteration are equivalent because they are both simply different ways of specifying loops. A computational process does not become a different computational process just because you different notation.

Recursion is mostly different from iteration because it has an implicit stack however a recursive algorithm can always be represented as an iterative program with an explicit stack. Likewise any iterative algorithm can always have its sequence of repetitions represented as a stack and made into a recursive program.

If the people can't handle nested loops then they wouldn't be able to function because most actions like walking and eating are made up of actions which are made up of sub actions which are themselves made up of smaller sub actions.
:PROPERTIES:
:Author: MrCogmor
:Score: 2
:DateUnix: 1529833322.0
:END:

***************************** #+begin_quote
  Recursion and Iteration are equivalent because they are both simply different ways of specifying loops. A computational process does not become a different computational process just because you different notation.
#+end_quote

I reject this premise, since I am going by the definition in the dictionary, which is what I specified. Recursion is a specific type of iteration, which is a base function.
:PROPERTIES:
:Author: Lightwavers
:Score: 1
:DateUnix: 1529836497.0
:END:

****************************** Then you are talking nonsense since there is no such thing as recursion that isn't functionally equivalent to simple iteration. I will give an example in pseudo code.

A simple transformation

#+begin_example
   SumNumbersUpToN(n): // Recursive
        if (n>0) {
             return n + SumNumbersUpToN(n-1) 
        else {
             return 0
        }
  }

   SumNumbersUpToN(n) { // Iterative
        sum=0
        for each integer i in range(0,n) {
               sum = sum + i
       }
       return sum
  }
#+end_example
:PROPERTIES:
:Author: MrCogmor
:Score: 3
:DateUnix: 1529838021.0
:END:

******************************* Saying it does not make it so.

#+begin_quote
  Recursion occurs when a thing is defined in terms of itself or of its type. Recursion is used in a variety of disciplines ranging from linguistics to logic. The most common application of recursion is in mathematics and computer science, where *a function being defined is applied within its own definition.* While this apparently defines an infinite number of instances (function values), it is often done in such a way that no loop or infinite chain of references can occur.
#+end_quote
:PROPERTIES:
:Author: Lightwavers
:Score: 1
:DateUnix: 1529838349.0
:END:

******************************** I'm aware of what recursion is and that doesn't contradict anything I posted.
:PROPERTIES:
:Author: MrCogmor
:Score: 2
:DateUnix: 1529838847.0
:END:

********************************* The bolded part is what matters: I'm talking recursion as in "a function being defined is applied within its own definition." That's not iteration, which is simply looping.
:PROPERTIES:
:Author: Lightwavers
:Score: 1
:DateUnix: 1529839009.0
:END:

********************************** Again that doesn't contradict anything I said. They are different ways of specifying a loop but any loop that can be specified in one can be specified in the other because they are computationally equivalent.

See [[https://en.wikipedia.org/wiki/Church%E2%80%93Turing_thesis][https://en.wikipedia.org/wiki/Church--Turing_thesis]]
:PROPERTIES:
:Author: MrCogmor
:Score: 2
:DateUnix: 1529839599.0
:END:

*********************************** I feel like you are intentionally missing the point.
:PROPERTIES:
:Author: Lightwavers
:Score: 1
:DateUnix: 1529844159.0
:END:

************************************ I feel like you are failing to grasp mine. The brain itself doesn't directly implement recursion. It uses a stochastic neural network which when given proper input can emulate recursion but isn't actually a recursive system. If elves can't directly recursion then they can model it fairly easily using iteration. This is actually what humans generally do. If they can't model procedures that could be implemented recursively then they can't model anything because you can implement any loop as nested recursion.

The basic way recursive functions are actually solved by humans and computers is iterative (though humans and compiler optimisations may actually skip the process in some process by using mathematical reasoning the answer must be a certain value) using a stack as I posted earlier.

E.g Let's say have the definition

#+begin_example
  EvenOrOdd(n):

      if n == 1: return odd


      if n == 2:  return even

      if EvenOrOdd(n−1) is odd {
           return even
      else
           return odd
#+end_example

And you are calculating EvenOrOdd(5) using the above algorithm (without skipping).

Your stack at start would be something like [

EvenOrOdd(5) At (START)

]

Then you would get to part with if EvenOrOdd(n−1) is odd and that would go on the stack

[

EvenOrOdd(4) At (START)

EvenOrOdd(5) At ( if EvenOrOdd(n−1) is odd {)

]

Again

[

EvenOrOdd(3) At (START)

EvenOrOdd(4) At ( if EvenOrOdd(n−1) is odd {)

EvenOrOdd(5) At ( if EvenOrOdd(n−1) is odd {)

]

Again except this time it is different

[ EvenOrOdd(2) At (if n == 2: return even)

EvenOrOdd(3) At ( if EvenOrOdd(n−1) is odd {)

EvenOrOdd(4) At ( if EvenOrOdd(n−1) is odd {)

EvenOrOdd(5) At ( if EvenOrOdd(n−1) is odd {)

]

There is a return value so

[

even

EvenOrOdd(3) At ( if EvenOrOdd(n−1) is odd {)

EvenOrOdd(4) At ( if EvenOrOdd(n−1) is odd {)

EvenOrOdd(5) At ( if EvenOrOdd(n−1) is odd {)

]

The value of the function is sent back to the function that called it. That in turn calculates its new value

[

odd

EvenOrOdd(4) At ( if EvenOrOdd(n−1) is odd {)

EvenOrOdd(5) At ( if EvenOrOdd(n−1) is odd {)

]

again

[

even

EvenOrOdd(5) At ( if EvenOrOdd(n−1) is odd {)

]

[

odd

]

Your answer is odd
:PROPERTIES:
:Author: MrCogmor
:Score: 3
:DateUnix: 1529848813.0
:END:

************************************* Again, I feel that you are missing the point. We are considering a fantasy scenario with nonhumans who may have different brain architecture.
:PROPERTIES:
:Author: Lightwavers
:Score: 1
:DateUnix: 1529850367.0
:END:

************************************** Different brain architecture doesn't matter. If it can use simple iteration then it can use it for recursive problems. If it can't use iteration then it can't really think.
:PROPERTIES:
:Author: MrCogmor
:Score: 2
:DateUnix: 1529851705.0
:END:

*************************************** You seem to be either intentionally misunderstanding me or trolling. Using the definition of recursion I provided only, without also bringing iteration into the mix, ban three levels of it for a selected nonhuman race that is literally magical. It does not make sense. It does not have to make sense.
:PROPERTIES:
:Author: Lightwavers
:Score: 1
:DateUnix: 1529851834.0
:END:

**************************************** A troll would not go to all this effort to explain themselves and would go after easier targets.

Things still have to make logical sense and specific enough to have a proper answer . E.p What if people were triangles? Is not a proper question.

If you take the strictest reading where elves are simply not able to understand deeply nested loops expressed in mathematical notation then they will simply devise a different but equivalent notation using iteration to express the same mathematical truths. They could also get a human to develop an iterative algorithm for transforming nested recursive functions to their iterative equivalents.
:PROPERTIES:
:Author: MrCogmor
:Score: 3
:DateUnix: 1529853331.0
:END:

***************************************** This does not have to make sense. Give the magical genie Agore infinite power and give her the task of stopping elves from recursing three times using the definition I gave, without hindering their general intelligence. It's a very specific mental block that does not have to make sense.
:PROPERTIES:
:Author: Lightwavers
:Score: 1
:DateUnix: 1529853594.0
:END:

****************************************** I'm no longer interested in this conversation
:PROPERTIES:
:Author: MrCogmor
:Score: 2
:DateUnix: 1529853682.0
:END:

******************************************* Why were you in the first place lol
:PROPERTIES:
:Author: Lightwavers
:Score: 1
:DateUnix: 1529853834.0
:END:

******************************************** I had free time and it was a decent way to revise my CS fundamentals.
:PROPERTIES:
:Author: MrCogmor
:Score: 1
:DateUnix: 1529854473.0
:END:

********************************************* Ah, see I just wanted to entertain the notion without being constrained by reality. I getcha.
:PROPERTIES:
:Author: Lightwavers
:Score: 1
:DateUnix: 1529855833.0
:END:

********************************************** Poor bait.
:PROPERTIES:
:Author: MrCogmor
:Score: 1
:DateUnix: 1529856669.0
:END:

*********************************************** Eh?
:PROPERTIES:
:Author: Lightwavers
:Score: 1
:DateUnix: 1529857793.0
:END:


**************************** Everything we do just about we've had to struggle to learn. Writing, for example.
:PROPERTIES:
:Author: ArgentStonecutter
:Score: 1
:DateUnix: 1529751226.0
:END:

***************************** Not everything though. Take breathing.
:PROPERTIES:
:Author: Lightwavers
:Score: 1
:DateUnix: 1529751406.0
:END:


****************** The fiction would have to be very irrational - there would be certain lists of instructions that you wouldn't be able to give an elf, for example, even though each individual instruction would be easy to follow.
:PROPERTIES:
:Author: holomanga
:Score: 1
:DateUnix: 1529787261.0
:END:

******************* Not in my opinion it wouldn't. It seems the only thing three levels of recursion is really useful for is lying, so that's really the only disadvantage they would have. And rational works definitely have concepts in them that break physics, such as actual magic in HPMOR. It's not too much of a stretch to imagine a race without one single ability that doesn't affect anything else. Because really, what are these certain instructions that you couldn't give an elf?
:PROPERTIES:
:Author: Lightwavers
:Score: 2
:DateUnix: 1529796438.0
:END:


