posts/"Only humans can think in three levels of recursion, and all other magical races stop at 2." What are the implications of this.8szydz.html
<li><a id="org3b4b972"></a>You don&rsquo;t have to comprehend recursion to simulate it. You aren&rsquo;t thinking in terms of recursion, you&rsquo;re thinking in terms of iteration.<br />
<div class="outline-text-9" id="text-1-3-1-1-1-1-1-1">
<p>
What you&rsquo;re talking about is some kind of memory limitation that can&rsquo;t be bypassed by reading and writing information in external memory. This amounts to functional illiteracy. Even something like &ldquo;they can&rsquo;t recall more than two items they&rsquo;ve read&rdquo; wouldn&rsquo;t do it, because you could still build a Beowulf Cluster of Grendels. I&rsquo;m not sure that a being so limited would be able to pass as a human in casual conversation.
</p>

<p>
So there&rsquo;s your answer.
</p>
<p>
:Author: ArgentStonecutter
:Score: 3
:DateUnix: 1529664783.0
</p>
</div>

<ol class="org-ol">
<li><a id="orgecab8e9"></a>I don&rsquo;t think you understand the difference between iteration and recursion. An iteration is a loop, a repetition, oftentimes with a variable changed each time. Recursion is taking a step back and calling a function within itself. So we take function thinking() and make it call function thinking() within itself, usually with something changed each iteration. An iteration is an important step in recursive functions, but while you need to iterate to recurse, iteration != recursion. Meanwhile, iterating function thinking() loops it continually. So you would be thinking about something, and then thinking about it again.<br />
<div class="outline-text-10" id="text-1-3-1-1-1-1-1-1-1">
</div>

<ol class="org-ol">
<li><a id="orge509424"></a>#+begin<sub>quote</sub><br />
<div class="outline-text-11" id="text-1-3-1-1-1-1-1-1-1-1">
<p>
  I don&rsquo;t think you understand the difference between iteration and recursion.
#+end<sub>quote</sub>
</p>

<p>
I have been a professional computer programmer for almost 40 years. I wrote my first compiler in 1979. I have implemented at least a dozen arithmetic expression parsers (an inherently recursive algorithm) in Fortran (a language that doesn&rsquo;t support recursion). I know the difference between iteration and recursion. Given indexable storage they are Turing-equivalent operations.
</p>
<p>
:Author: ArgentStonecutter
:Score: 5
:DateUnix: 1529665451.0
</p>
</div>

<ol class="org-ol">
<li><a id="org989ccee"></a>Fact: iteration is basically looping.<br />
<div class="outline-text-12" id="text-1-3-1-1-1-1-1-1-1-1-1">
<p>
Fact: recursion is a function that calls itself each iteration.
</p>

<p>
Fact: you claim to know this.
</p>

<p>
Fact: you also claim that being unable to intuitively understand recursion at three levels is equivalent to being functionally illiterate.
</p>
<p>
:Author: Lightwavers
:Score: 2
:DateUnix: 1529665674.0
</p>
</div>

<ol class="org-ol">
<li><a id="org588a7c9"></a>#+begin<sub>quote</sub><br />
<div class="outline-text-13" id="text-1-3-1-1-1-1-1-1-1-1-1-1">
<p>
Fact: iteration is basically looping.
</p>

<p>
  Fact: recursion is a function that calls itself each iteration.
#+end<sub>quote</sub>
</p>

<p>
Iteration and recursion are both tools that can be used to implement a recursive algorithm. Therefore iteration with a simulated stack is equivalent to recursion. This is basic computational theory. This is literally what &ldquo;Turing equivalence&rdquo; means.
</p>

<blockquote>
<p>
Fact: you also claim that being unable to intuitively understand recursion at three levels is equivalent to being functionally illiterate.
</p>
</blockquote>

<p>
The claim that I made is &ldquo;being unable to understand recursion at three levels given bookkeeping tools requires being functionally illiterate&rdquo;. You believe that the noise-word &ldquo;intuitively&rdquo; changes the meaning of this sentence.
</p>
<p>
:Author: ArgentStonecutter
:Score: 9
:DateUnix: 1529666911.0
</p>
</div>

<ol class="org-ol">
<li><a id="org1a325dc"></a>#+begin<sub>quote</sub><br />
<div class="outline-text-14" id="text-1-3-1-1-1-1-1-1-1-1-1-1-1">
<p>
  Iteration and recursion are both tools that can be used to implement a recursive algorithm.
#+end<sub>quote</sub>
</p>

<p>
But this is false, yes? Iteration is a necessary part of a working recursive algorithm, and recursion is a word that encompasses everything a recursive algorithm is. They are not at all the same, as you can, for example, iterate through a list without recursing.
</p>

<blockquote>
<p>
The claim that I made is &ldquo;being unable to understand recursion at three levels given bookkeeping tools requires being functionally illiterate&rdquo;.
</p>
</blockquote>

<p>
But the word &rsquo;intuitively&rsquo; <i>does</i> change the meaning of that sentence. If they are able to work it out in the end, but can&rsquo;t grasp it immediately, it puts an advantage on the person who can. Plus the one without intuition may not ever realize there was something to work out if they aren&rsquo;t that rational.
</p>
<p>
:Author: Lightwavers
:Score: 1
:DateUnix: 1529667634.0
</p>
</div>

<ol class="org-ol">
<li><a id="org090d442"></a>No. Iteration with bookkeeping is turing-equivalent to recursion. You <i>can</i> implement a Pascal interpreter in Fortran.<br />
<div class="outline-text-15" id="text-1-3-1-1-1-1-1-1-1-1-1-1-1-1">
<p>
There are differences in how quickly people can think, regardless of artificial restrictions. Think of the difference between Goyle and Granger.
</p>
<p>
:Author: ArgentStonecutter
:Score: 3
:DateUnix: 1529669491.0
</p>
</div>

<ol class="org-ol">
<li><a id="orgc6bbaf2"></a>I feel like allowing that to be called iteration is kind of muddying the words. Recursion has a specific meaning, right, and when it&rsquo;s allowed to mean the exact same thing as iteration, it kind of adds unnecessary confusion.<br />
<div class="outline-text-16" id="text-1-3-1-1-1-1-1-1-1-1-1-1-1-1-1">
<p>
But that&rsquo;s off topic&#x2014;people have biases. Why can&rsquo;t reducing be level of recursion that humans can intuitively think in by one for a magical race be hypothetically considered? No need to reduce the speed of thought.
</p>
<p>
:Author: Lightwavers
:Score: 2
:DateUnix: 1529670303.0
</p>
</div>

<ol class="org-ol">
<li><a id="org7370e93"></a>#+begin<sub>quote</sub><br />
<div class="outline-text-17" id="text-1-3-1-1-1-1-1-1-1-1-1-1-1-1-1-1">
<p>
  I feel like allowing that to be called iteration is kind of muddying the words.
#+end<sub>quote</sub>
</p>

<p>
It&rsquo;s perfectly conventional computing theory. This kind of equivalence is actually kind of central to the whole structure of computing. No processor in the world implements &ldquo;recursion&rdquo; as a basic operation, they all put it together from iteration and bookkeeping.
</p>

<p>
The point is that this oddly specific deficit is probably computationally impossible, and violates the Strong Church-Turing Hypothesis. Which I&rsquo;m pretty sure EY didn&rsquo;t intend. It was a throwaway line that sounds good, but it&rsquo;s not essential, and can be treated as a minor oops.
</p>
<p>
:Author: ArgentStonecutter
:Score: 7
:DateUnix: 1529670830.0
</p>
</div>

<ol class="org-ol">
<li><a id="org03db869"></a>But fantasy breaks physics all the time. Just rolling with it, i think it&rsquo;s a pretty cool idea.<br />
<div class="outline-text-18" id="text-1-3-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1">
</div>

<ol class="org-ol">
<li><a id="org586a1e5"></a>Fantasy or not, you can&rsquo;t argue that the computational equivalence of iteration+bookkeeping to recursion is &ldquo;muddying the words&rdquo;.<br />
<div class="outline-text-19" id="text-1-3-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1">
</div>

<ol class="org-ol">
<li><a id="orgf603711"></a>Why not? In those very soecifics cases where it matters that deep down, they are both the same thing, then sure, point that out. But in all other cases, recursion and iteration both have specific definitions that do not mean the same thing.<br />
<div class="outline-text-20" id="text-1-3-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1">
</div>

<ol class="org-ol">
<li><a id="orgd0254fa"></a>Because minds are computational structures.<br />
<div class="outline-text-21" id="text-1-3-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1">
</div>

<ol class="org-ol">
<li><a id="org4104e95"></a>Right, but right now we&rsquo;re talking about definitions, so that&rsquo;s kind of a non sequitur.<br />
<div class="outline-text-22" id="text-1-3-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1">
</div>

<ol class="org-ol">
<li><a id="org34958a0"></a>We&rsquo;re talking about minds. Whatever. <a href="http://metamagician3000.blogspot.com/2009/09/interview-with-greg-egan.html">Let me leave you with a quote from Greg Egan</a>:<br />
<div class="outline-text-23" id="text-1-3-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1">
<blockquote>
<p>
I believe that humans have already crossed a threshold that, in a certain sense, puts us on an equal footing with any other being who has mastered abstract reasoning. There&rsquo;s a notion in computing science of “Turing completeness”, which says that once a computer can perform a set of quite basic operations, it can be programmed to do absolutely any calculation that any other computer can do. Other computers might be faster, or have more memory, or have multiple processors running at the same time, but my 1988 Amiga 500 really could be programmed to do anything my 2008 iMac can do &#x2014; apart from responding to external events in real time &#x2014; if only I had the patience to sit and swap floppy disks all day long. I suspect that something broadly similar applies to minds and the class of things they can understand: other beings might think faster than us, or have easy access to a greater store of facts, but underlying both mental processes will be the same basic set of general-purpose tools. So if we ever did encounter those billion-year-old aliens, I&rsquo;m sure they&rsquo;d have plenty to tell us that we didn&rsquo;t yet know &#x2014; but given enough patience, and a very large notebook, I believe we&rsquo;d still be able to come to grips with whatever they had to say.
</p>
</blockquote>
<p>
:Author: ArgentStonecutter
:Score: 1
:DateUnix: 1529709307.0
</p>
</div>

<ol class="org-ol">
<li><a id="org331451a"></a>Yes, that&rsquo;s true. However, to simplify things and be more accurate, how about we refer to the words recursion and iteration as they are dictionarily defined, rather than being technically correct but overly pedantic about it?<br />
<div class="outline-text-24" id="text-1-3-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1">
</div>

<ol class="org-ol">
<li><a id="orgf365573"></a>Because we are explicitly talking about technical limitations of computation. The actual technical meanings <i>are</i> the relevant ones.<br />
<div class="outline-text-25" id="text-1-3-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1">
</div>

<ol class="org-ol">
<li><a id="org0caa2bd"></a>We&rsquo;re talking the practical consequences of limited computation in a certain, hypothesized subset of a nonexistent population where nothing except the actual real world effects matter.<br />
<div class="outline-text-26" id="text-1-3-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1">
</div>

<ol class="org-ol">
<li><a id="org9a26e5e"></a>And I&rsquo;m saying they can still learn to perform that computation, regardless of the hypothetical deficit. This is not about the definitions. I&rsquo;m not changing the definitions, I&rsquo;m pointing out that the combination of capabilities they have is computationally equivalent.<br />
<div class="outline-text-27" id="text-1-3-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1">
</div>

<ol class="org-ol">
<li><a id="orgbf147f5"></a>Okay, yes but that&rsquo;s not the point. Sure, if they struggle long enough hey may be able to get it. But we&rsquo;re looking at the implications for a race that will not get it without practice and some working out.<br />
<div class="outline-text-28" id="text-1-3-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1">
</div>

<ol class="org-ol">
<li><a id="org466bbc9"></a>Recursion and Iteration are equivalent because they are both simply different ways of specifying loops. A computational process does not become a different computational process just because you different notation.<br />
<div class="outline-text-29" id="text-1-3-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1">
<p>
Recursion is mostly different from iteration because it has an implicit stack however a recursive algorithm can always be represented as an iterative program with an explicit stack. Likewise any iterative algorithm can always have its sequence of repetitions represented as a stack and made into a recursive program.
</p>

<p>
If the people can&rsquo;t handle nested loops then they wouldn&rsquo;t be able to function because most actions like walking and eating are made up of actions which are made up of sub actions which are themselves made up of smaller sub actions.
</p>
<p>
:Author: MrCogmor
:Score: 2
:DateUnix: 1529833322.0
</p>
</div>

<ol class="org-ol">
<li><a id="org2f28c15"></a>#+begin<sub>quote</sub><br />
<div class="outline-text-30" id="text-1-3-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1">
<p>
  Recursion and Iteration are equivalent because they are both simply different ways of specifying loops. A computational process does not become a different computational process just because you different notation.
#+end<sub>quote</sub>
</p>

<p>
I reject this premise, since I am going by the definition in the dictionary, which is what I specified. Recursion is a specific type of iteration, which is a base function.
</p>
<p>
:Author: Lightwavers
:Score: 1
:DateUnix: 1529836497.0
</p>
</div>

<ol class="org-ol">
<li><a id="org09eb32e"></a>Then you are talking nonsense since there is no such thing as recursion that isn&rsquo;t functionally equivalent to simple iteration. I will give an example in pseudo code.<br />
<div class="outline-text-31" id="text-1-3-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1">
<p>
A simple transformation
</p>

<pre class="example" id="orga66aacb">
   SumNumbersUpToN(n): // Recursive
        if (n&gt;0) {
             return n + SumNumbersUpToN(n-1) 
        else {
             return 0
        }
  }

   SumNumbersUpToN(n) { // Iterative
        sum=0
        for each integer i in range(0,n) {
               sum = sum + i
       }
       return sum
  }
</pre>
<p>
:Author: MrCogmor
:Score: 3
:DateUnix: 1529838021.0
</p>
</div>

<ol class="org-ol">
<li><a id="org62c56cf"></a>Saying it does not make it so.<br />
<div class="outline-text-32" id="text-1-3-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1">
<blockquote>
<p>
Recursion occurs when a thing is defined in terms of itself or of its type. Recursion is used in a variety of disciplines ranging from linguistics to logic. The most common application of recursion is in mathematics and computer science, where <b>a function being defined is applied within its own definition.</b> While this apparently defines an infinite number of instances (function values), it is often done in such a way that no loop or infinite chain of references can occur.
</p>
</blockquote>
<p>
:Author: Lightwavers
:Score: 1
:DateUnix: 1529838349.0
</p>
</div>

<ol class="org-ol">
<li><a id="org20ce6e3"></a>I&rsquo;m aware of what recursion is and that doesn&rsquo;t contradict anything I posted.<br />
<div class="outline-text-33" id="text-1-3-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1">
</div>

<ol class="org-ol">
<li><a id="org74b4488"></a>The bolded part is what matters: I&rsquo;m talking recursion as in &ldquo;a function being defined is applied within its own definition.&rdquo; That&rsquo;s not iteration, which is simply looping.<br />
<div class="outline-text-34" id="text-1-3-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1">
</div>

<ol class="org-ol">
<li><a id="orgdc501ed"></a>Again that doesn&rsquo;t contradict anything I said. They are different ways of specifying a loop but any loop that can be specified in one can be specified in the other because they are computationally equivalent.<br />
<div class="outline-text-35" id="text-1-3-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1">
<p>
See <a href="https://en.wikipedia.org/wiki/Church%E2%80%93Turing_thesis">https://en.wikipedia.org/wiki/Church&#x2013;Turing<sub>thesis</sub></a>
</p>
<p>
:Author: MrCogmor
:Score: 2
:DateUnix: 1529839599.0
</p>
</div>

<ol class="org-ol">
<li><a id="org62fc98e"></a>I feel like you are intentionally missing the point.<br />
<div class="outline-text-36" id="text-1-3-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1">
</div>

<ol class="org-ol">
<li><a id="org3ae6f98"></a>I feel like you are failing to grasp mine. The brain itself doesn&rsquo;t directly implement recursion. It uses a stochastic neural network which when given proper input can emulate recursion but isn&rsquo;t actually a recursive system. If elves can&rsquo;t directly recursion then they can model it fairly easily using iteration. This is actually what humans generally do. If they can&rsquo;t model procedures that could be implemented recursively then they can&rsquo;t model anything because you can implement any loop as nested recursion.<br />
<div class="outline-text-37" id="text-1-3-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1">
<p>
The basic way recursive functions are actually solved by humans and computers is iterative (though humans and compiler optimisations may actually skip the process in some process by using mathematical reasoning the answer must be a certain value) using a stack as I posted earlier.
</p>

<p>
E.g Let&rsquo;s say have the definition
</p>

<pre class="example" id="org177a05e">
  EvenOrOdd(n):

      if n == 1: return odd


      if n == 2:  return even

      if EvenOrOdd(n−1) is odd {
           return even
      else
           return odd
</pre>

<p>
And you are calculating EvenOrOdd(5) using the above algorithm (without skipping).
</p>

<p>
Your stack at start would be something like [
</p>

<p>
EvenOrOdd(5) At (START)
</p>

<p>
]
</p>

<p>
Then you would get to part with if EvenOrOdd(n−1) is odd and that would go on the stack
</p>

<p>
[
</p>

<p>
EvenOrOdd(4) At (START)
</p>

<p>
EvenOrOdd(5) At ( if EvenOrOdd(n−1) is odd {)
</p>

<p>
]
</p>

<p>
Again
</p>

<p>
[
</p>

<p>
EvenOrOdd(3) At (START)
</p>

<p>
EvenOrOdd(4) At ( if EvenOrOdd(n−1) is odd {)
</p>

<p>
EvenOrOdd(5) At ( if EvenOrOdd(n−1) is odd {)
</p>

<p>
]
</p>

<p>
Again except this time it is different
</p>

<p>
[ EvenOrOdd(2) At (if n == 2: return even)
</p>

<p>
EvenOrOdd(3) At ( if EvenOrOdd(n−1) is odd {)
</p>

<p>
EvenOrOdd(4) At ( if EvenOrOdd(n−1) is odd {)
</p>

<p>
EvenOrOdd(5) At ( if EvenOrOdd(n−1) is odd {)
</p>

<p>
]
</p>

<p>
There is a return value so
</p>

<p>
[
</p>

<p>
even
</p>

<p>
EvenOrOdd(3) At ( if EvenOrOdd(n−1) is odd {)
</p>

<p>
EvenOrOdd(4) At ( if EvenOrOdd(n−1) is odd {)
</p>

<p>
EvenOrOdd(5) At ( if EvenOrOdd(n−1) is odd {)
</p>

<p>
]
</p>

<p>
The value of the function is sent back to the function that called it. That in turn calculates its new value
</p>

<p>
[
</p>

<p>
odd
</p>

<p>
EvenOrOdd(4) At ( if EvenOrOdd(n−1) is odd {)
</p>

<p>
EvenOrOdd(5) At ( if EvenOrOdd(n−1) is odd {)
</p>

<p>
]
</p>

<p>
again
</p>

<p>
[
</p>

<p>
even
</p>

<p>
EvenOrOdd(5) At ( if EvenOrOdd(n−1) is odd {)
</p>

<p>
]
</p>

<p>
[
</p>

<p>
odd
</p>

<p>
]
</p>

<p>
Your answer is odd
</p>
<p>
:Author: MrCogmor
:Score: 3
:DateUnix: 1529848813.0
</p>
</div>

<ol class="org-ol">
<li><a id="orgbc02c5a"></a>Again, I feel that you are missing the point. We are considering a fantasy scenario with nonhumans who may have different brain architecture.<br />
<div class="outline-text-38" id="text-1-3-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1">
</div>

<ol class="org-ol">
<li><a id="org8c5df42"></a>Different brain architecture doesn&rsquo;t matter. If it can use simple iteration then it can use it for recursive problems. If it can&rsquo;t use iteration then it can&rsquo;t really think.<br />
<div class="outline-text-39" id="text-1-3-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1">
</div>

<ol class="org-ol">
<li><a id="org33d92c4"></a>You seem to be either intentionally misunderstanding me or trolling. Using the definition of recursion I provided only, without also bringing iteration into the mix, ban three levels of it for a selected nonhuman race that is literally magical. It does not make sense. It does not have to make sense.<br />
<div class="outline-text-40" id="text-1-3-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1">
</div>

<ol class="org-ol">
<li><a id="org3c0dfa5"></a>A troll would not go to all this effort to explain themselves and would go after easier targets.<br />
<div class="outline-text-41" id="text-1-3-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1">
<p>
Things still have to make logical sense and specific enough to have a proper answer . E.p What if people were triangles? Is not a proper question.
</p>

<p>
If you take the strictest reading where elves are simply not able to understand deeply nested loops expressed in mathematical notation then they will simply devise a different but equivalent notation using iteration to express the same mathematical truths. They could also get a human to develop an iterative algorithm for transforming nested recursive functions to their iterative equivalents.
</p>
<p>
:Author: MrCogmor
:Score: 3
:DateUnix: 1529853331.0
</p>
</div>

<ol class="org-ol">
<li><a id="orgdc98969"></a>This does not have to make sense. Give the magical genie Agore infinite power and give her the task of stopping elves from recursing three times using the definition I gave, without hindering their general intelligence. It&rsquo;s a very specific mental block that does not have to make sense.<br />
<div class="outline-text-42" id="text-1-3-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1">
</div>

<ol class="org-ol">
<li><a id="org55984eb"></a>I&rsquo;m no longer interested in this conversation<br />
<div class="outline-text-43" id="text-1-3-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1">
</div>

<ol class="org-ol">
<li><a id="orga6d0901"></a>Why were you in the first place lol<br />
<div class="outline-text-44" id="text-1-3-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1">
</div>

<ol class="org-ol">
<li><a id="orgc586be2"></a>I had free time and it was a decent way to revise my CS fundamentals.<br />
<div class="outline-text-45" id="text-1-3-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1">
</div>

<ol class="org-ol">
<li><a id="org2843018"></a>Ah, see I just wanted to entertain the notion without being constrained by reality. I getcha.<br />
<div class="outline-text-46" id="text-1-3-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1">
</div>

<ol class="org-ol">
<li><a id="org4feb5ff"></a>Poor bait.<br />
<div class="outline-text-47" id="text-1-3-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1">
</div>

<ol class="org-ol">
<li><a id="orgf00667d"></a>Eh?<br />
<div class="outline-text-48" id="text-1-3-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1">
</div>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>


<li><a id="orge0dfb3a"></a>Everything we do just about we&rsquo;ve had to struggle to learn. Writing, for example.<br />
<div class="outline-text-29" id="text-1-3-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1">
</div>

<ol class="org-ol">
<li><a id="orgea8c2a2"></a>Not everything though. Take breathing.<br />
<div class="outline-text-30" id="text-1-3-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1">
</div>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>


<li><a id="org11ca186"></a>The fiction would have to be very irrational - there would be certain lists of instructions that you wouldn&rsquo;t be able to give an elf, for example, even though each individual instruction would be easy to follow.<br />
<div class="outline-text-19" id="text-1-3-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-2">
</div>

<ol class="org-ol">
<li><a id="org6d32cb8"></a>Not in my opinion it wouldn&rsquo;t. It seems the only thing three levels of recursion is really useful for is lying, so that&rsquo;s really the only disadvantage they would have. And rational works definitely have concepts in them that break physics, such as actual magic in HPMOR. It&rsquo;s not too much of a stretch to imagine a race without one single ability that doesn&rsquo;t affect anything else. Because really, what are these certain instructions that you couldn&rsquo;t give an elf?<br />
<div class="outline-text-20" id="text-1-3-1-1-1-1-1-1-1-1-1-1-1-1-1-1-1-2-1">
</div>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</div>
