"Only humans can think in three levels of recursion, and all other magical races stop at 2." What are the implications of this.8szydz.org
*** You won't get very far in the game of political intrigue if you're breaking out the pen and paper for plots everyone else is doing in their head.
:PROPERTIES:
:Author: turtleswamp
:Score: 1
:DateUnix: 1530311628.0
:END:


** This topic is a black hole of contemplation. It's far too easy to just sit down and try to puzzle it out. It's fun thought, and potentially useful (for psychology especially).

Let's assume the function that's recusing is (person) thinking.

1: Me Thinking (Joe thinking) => I know how Joe thinks. I can predict his behaviors, generally.\\
Animals have it- wolves that know how to herd their prey away from the herd, cause they know how their prey will react.\\
Also metacognition (not for animals though, unless really basic)- I know I'll normally run away in panic after seeing hungry wolves, and that's bad (because an elf can protect me, but only if I am close to him). So I do things (breathing exercises?) to stop myself from panicking.

2: Me Thinking(Joe thinking(me thinking)) => I know what Joe thinks about my behavior. I know what Joe's model of me. An Elf (Joe) may lure a pack of wolves into thinking he's defenseless, because he can fake vulnerable behavior.

3: Me thinking (Joe thinking(me thinking(me thinking)) - I know how Joe models my meta-cognition.\\
Joe thinks I am aware of my panic attacks, but not of me getting distracted by background chatter.\\
So he tries to make me bet on finishing writing a letter before it gets completely dark, while purposefully saying random stuff. Except I know what he's trying to do, and got earplugs prepared before hand. Bet won, humanity wins!

Thanks to being a level higher on recursion, I was able to out-intrigue a magical person.\\
Could Joe use pen and paper to think about this possibility? Sure. But he may not see the need (why bother?), not have the energy (it's like doing /calculus/), or not have pen or paper at hand.\\
Or, you know, he didn't attend Advanced Social Dynamics class at his school. Or he didn't deal with humans nearly enough to pick up on their advantage and counter it.\\
What I am trying to say is: a non-intuitive skill is harder to acquire and use properly; recursion is great for mind-games, and humans are naturally better than elves at it.

There's also the implication that magical races may have other mental handicaps compared to us. As far as I know, there isn't a piece of brain responsible solely for recursion. This limitation may be a result of smaller working memory or worse imagination or something.

So... don't diss Eliezer's crazy ideas, Lightwavers- "practically useless" is not a phrase that exists for writers, especially of the fantasy genre.
:PROPERTIES:
:Author: PurposefulZephyr
:Score: 1
:DateUnix: 1530136079.0
:END:

*** Haha, I wasn't dissing the idea. I asked because it seemed interesting but I didn't know what exactly it meant. :)
:PROPERTIES:
:Author: Lightwavers
:Score: 1
:DateUnix: 1530140343.0
:END:
