posts/"Only humans can think in three levels of recursion, and all other magical races stop at 2." What are the implications of this.8szydz.html


<div id="outline-container-orgdaa362a" class="outline-4">
<h4 id="orgdaa362a"><span class="section-number-4">1.3.2</span> You won&rsquo;t get very far in the game of political intrigue if you&rsquo;re breaking out the pen and paper for plots everyone else is doing in their head.</h4>
<div class="outline-text-4" id="text-1-3-2">
</div>
</div>
</div>


<div id="outline-container-orgf2c9216" class="outline-3">
<h3 id="orgf2c9216"><span class="section-number-3">1.4</span> This topic is a black hole of contemplation. It&rsquo;s far too easy to just sit down and try to puzzle it out. It&rsquo;s fun thought, and potentially useful (for psychology especially).</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Let&rsquo;s assume the function that&rsquo;s recusing is (person) thinking.
</p>

<p>
1: Me Thinking (Joe thinking) =&gt; I know how Joe thinks. I can predict his behaviors, generally.<br />
Animals have it- wolves that know how to herd their prey away from the herd, cause they know how their prey will react.<br />
Also metacognition (not for animals though, unless really basic)- I know I&rsquo;ll normally run away in panic after seeing hungry wolves, and that&rsquo;s bad (because an elf can protect me, but only if I am close to him). So I do things (breathing exercises?) to stop myself from panicking.
</p>

<p>
2: Me Thinking(Joe thinking(me thinking)) =&gt; I know what Joe thinks about my behavior. I know what Joe&rsquo;s model of me. An Elf (Joe) may lure a pack of wolves into thinking he&rsquo;s defenseless, because he can fake vulnerable behavior.
</p>

<p>
3: Me thinking (Joe thinking(me thinking(me thinking)) - I know how Joe models my meta-cognition.<br />
Joe thinks I am aware of my panic attacks, but not of me getting distracted by background chatter.<br />
So he tries to make me bet on finishing writing a letter before it gets completely dark, while purposefully saying random stuff. Except I know what he&rsquo;s trying to do, and got earplugs prepared before hand. Bet won, humanity wins!
</p>

<p>
Thanks to being a level higher on recursion, I was able to out-intrigue a magical person.<br />
Could Joe use pen and paper to think about this possibility? Sure. But he may not see the need (why bother?), not have the energy (it&rsquo;s like doing <i>calculus</i>), or not have pen or paper at hand.<br />
Or, you know, he didn&rsquo;t attend Advanced Social Dynamics class at his school. Or he didn&rsquo;t deal with humans nearly enough to pick up on their advantage and counter it.<br />
What I am trying to say is: a non-intuitive skill is harder to acquire and use properly; recursion is great for mind-games, and humans are naturally better than elves at it.
</p>

<p>
There&rsquo;s also the implication that magical races may have other mental handicaps compared to us. As far as I know, there isn&rsquo;t a piece of brain responsible solely for recursion. This limitation may be a result of smaller working memory or worse imagination or something.
</p>

<p>
So&#x2026; don&rsquo;t diss Eliezer&rsquo;s crazy ideas, Lightwavers- &ldquo;practically useless&rdquo; is not a phrase that exists for writers, especially of the fantasy genre.
</p>
<p>
:Author: PurposefulZephyr
:Score: 1
:DateUnix: 1530136079.0
</p>
</div>

<div id="outline-container-org5287bf6" class="outline-4">
<h4 id="org5287bf6"><span class="section-number-4">1.4.1</span> Haha, I wasn&rsquo;t dissing the idea. I asked because it seemed interesting but I didn&rsquo;t know what exactly it meant. :)</h4>
<div class="outline-text-4" id="text-1-4-1">
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Fereidoon</p>
<p class="date">Created: 2021-05-31 Mon 05:33</p>
</div>
</body>
</html>
